
/home/vbesnard/Doctorat/Recherche/code/gits/uml-interpreter-c/samples/ChallengeMDETools/ChallengeModularv2/ChallengeConcreteEnv.emi/build/host/.build//model.o:     file format elf64-x86-64

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xd1ce (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xcb7b): GNU C99 6.3.0 20170516 -mtune=generic -march=x86-64 -g -O0 -std=c99
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x6d0c): model.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xe806): /home/vbesnard/Doctorat/Recherche/code/gits/uml-interpreter-c/samples/ChallengeMDETools/ChallengeModularv2/ChallengeConcreteEnv.emi/src
    <19>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_high_pc     : 0x3247
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x79f3): size_t
    <32>   DW_AT_decl_file   : 2
    <33>   DW_AT_decl_line   : 216
    <34>   DW_AT_type        : <0x38>
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 7	(unsigned)
    <3b>   DW_AT_name        : (indirect string, offset: 0xe63c): long unsigned int
 <1><3f>: Abbrev Number: 4 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 4
    <41>   DW_AT_encoding    : 5	(signed)
    <42>   DW_AT_name        : int
 <1><46>: Abbrev Number: 3 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 4
    <48>   DW_AT_encoding    : 7	(unsigned)
    <49>   DW_AT_name        : (indirect string, offset: 0x14e88): unsigned int
 <1><4d>: Abbrev Number: 3 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 8
    <4f>   DW_AT_encoding    : 5	(signed)
    <50>   DW_AT_name        : (indirect string, offset: 0xd6fa): long int
 <1><54>: Abbrev Number: 3 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 8
    <56>   DW_AT_encoding    : 5	(signed)
    <57>   DW_AT_name        : (indirect string, offset: 0x13871): long long int
 <1><5b>: Abbrev Number: 3 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 8
    <5d>   DW_AT_encoding    : 7	(unsigned)
    <5e>   DW_AT_name        : (indirect string, offset: 0xbdc8): sizetype
 <1><62>: Abbrev Number: 3 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 2
    <64>   DW_AT_encoding    : 7	(unsigned)
    <65>   DW_AT_name        : (indirect string, offset: 0xc0e3): short unsigned int
 <1><69>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <6a>   DW_AT_byte_size   : 8
    <6b>   DW_AT_type        : <0x7b>
 <1><6f>: Abbrev Number: 6 (DW_TAG_const_type)
    <70>   DW_AT_type        : <0x69>
 <1><74>: Abbrev Number: 3 (DW_TAG_base_type)
    <75>   DW_AT_byte_size   : 1
    <76>   DW_AT_encoding    : 6	(signed char)
    <77>   DW_AT_name        : (indirect string, offset: 0xebea): char
 <1><7b>: Abbrev Number: 6 (DW_TAG_const_type)
    <7c>   DW_AT_type        : <0x74>
 <1><80>: Abbrev Number: 3 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 1
    <82>   DW_AT_encoding    : 8	(unsigned char)
    <83>   DW_AT_name        : (indirect string, offset: 0x582f): unsigned char
 <1><87>: Abbrev Number: 3 (DW_TAG_base_type)
    <88>   DW_AT_byte_size   : 1
    <89>   DW_AT_encoding    : 6	(signed char)
    <8a>   DW_AT_name        : (indirect string, offset: 0xc0f6): signed char
 <1><8e>: Abbrev Number: 3 (DW_TAG_base_type)
    <8f>   DW_AT_byte_size   : 2
    <90>   DW_AT_encoding    : 5	(signed)
    <91>   DW_AT_name        : (indirect string, offset: 0x1535c): short int
 <1><95>: Abbrev Number: 2 (DW_TAG_typedef)
    <96>   DW_AT_name        : (indirect string, offset: 0x19b4): __off_t
    <9a>   DW_AT_decl_file   : 3
    <9b>   DW_AT_decl_line   : 131
    <9c>   DW_AT_type        : <0x4d>
 <1><a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0xc8d3): __off64_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 132
    <a7>   DW_AT_type        : <0x4d>
 <1><ab>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ac>   DW_AT_byte_size   : 8
 <1><ad>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ae>   DW_AT_byte_size   : 8
    <af>   DW_AT_type        : <0x74>
 <1><b3>: Abbrev Number: 2 (DW_TAG_typedef)
    <b4>   DW_AT_name        : (indirect string, offset: 0xb5a4): int8_t
    <b8>   DW_AT_decl_file   : 4
    <b9>   DW_AT_decl_line   : 194
    <ba>   DW_AT_type        : <0x87>
 <1><be>: Abbrev Number: 2 (DW_TAG_typedef)
    <bf>   DW_AT_name        : (indirect string, offset: 0x2523): int32_t
    <c3>   DW_AT_decl_file   : 4
    <c4>   DW_AT_decl_line   : 196
    <c5>   DW_AT_type        : <0x3f>
 <1><c9>: Abbrev Number: 3 (DW_TAG_base_type)
    <ca>   DW_AT_byte_size   : 8
    <cb>   DW_AT_encoding    : 7	(unsigned)
    <cc>   DW_AT_name        : (indirect string, offset: 0x120fe): long long unsigned int
 <1><d0>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d1>   DW_AT_name        : (indirect string, offset: 0xf6d5): _IO_FILE
    <d5>   DW_AT_byte_size   : 216
    <d6>   DW_AT_decl_file   : 5
    <d7>   DW_AT_decl_line   : 241
    <d8>   DW_AT_sibling     : <0x24d>
 <2><dc>: Abbrev Number: 9 (DW_TAG_member)
    <dd>   DW_AT_name        : (indirect string, offset: 0x17a0): _flags
    <e1>   DW_AT_decl_file   : 5
    <e2>   DW_AT_decl_line   : 242
    <e3>   DW_AT_type        : <0x3f>
    <e7>   DW_AT_data_member_location: 0
 <2><e8>: Abbrev Number: 9 (DW_TAG_member)
    <e9>   DW_AT_name        : (indirect string, offset: 0x12a97): _IO_read_ptr
    <ed>   DW_AT_decl_file   : 5
    <ee>   DW_AT_decl_line   : 247
    <ef>   DW_AT_type        : <0xad>
    <f3>   DW_AT_data_member_location: 8
 <2><f4>: Abbrev Number: 9 (DW_TAG_member)
    <f5>   DW_AT_name        : (indirect string, offset: 0xf34d): _IO_read_end
    <f9>   DW_AT_decl_file   : 5
    <fa>   DW_AT_decl_line   : 248
    <fb>   DW_AT_type        : <0xad>
    <ff>   DW_AT_data_member_location: 16
 <2><100>: Abbrev Number: 9 (DW_TAG_member)
    <101>   DW_AT_name        : (indirect string, offset: 0xca04): _IO_read_base
    <105>   DW_AT_decl_file   : 5
    <106>   DW_AT_decl_line   : 249
    <107>   DW_AT_type        : <0xad>
    <10b>   DW_AT_data_member_location: 24
 <2><10c>: Abbrev Number: 9 (DW_TAG_member)
    <10d>   DW_AT_name        : (indirect string, offset: 0xd025): _IO_write_base
    <111>   DW_AT_decl_file   : 5
    <112>   DW_AT_decl_line   : 250
    <113>   DW_AT_type        : <0xad>
    <117>   DW_AT_data_member_location: 32
 <2><118>: Abbrev Number: 9 (DW_TAG_member)
    <119>   DW_AT_name        : (indirect string, offset: 0x6ecf): _IO_write_ptr
    <11d>   DW_AT_decl_file   : 5
    <11e>   DW_AT_decl_line   : 251
    <11f>   DW_AT_type        : <0xad>
    <123>   DW_AT_data_member_location: 40
 <2><124>: Abbrev Number: 9 (DW_TAG_member)
    <125>   DW_AT_name        : (indirect string, offset: 0x302b): _IO_write_end
    <129>   DW_AT_decl_file   : 5
    <12a>   DW_AT_decl_line   : 252
    <12b>   DW_AT_type        : <0xad>
    <12f>   DW_AT_data_member_location: 48
 <2><130>: Abbrev Number: 9 (DW_TAG_member)
    <131>   DW_AT_name        : (indirect string, offset: 0xefcb): _IO_buf_base
    <135>   DW_AT_decl_file   : 5
    <136>   DW_AT_decl_line   : 253
    <137>   DW_AT_type        : <0xad>
    <13b>   DW_AT_data_member_location: 56
 <2><13c>: Abbrev Number: 9 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0xe4f): _IO_buf_end
    <141>   DW_AT_decl_file   : 5
    <142>   DW_AT_decl_line   : 254
    <143>   DW_AT_type        : <0xad>
    <147>   DW_AT_data_member_location: 64
 <2><148>: Abbrev Number: 10 (DW_TAG_member)
    <149>   DW_AT_name        : (indirect string, offset: 0x8445): _IO_save_base
    <14d>   DW_AT_decl_file   : 5
    <14e>   DW_AT_decl_line   : 256
    <150>   DW_AT_type        : <0xad>
    <154>   DW_AT_data_member_location: 72
 <2><155>: Abbrev Number: 10 (DW_TAG_member)
    <156>   DW_AT_name        : (indirect string, offset: 0x129d6): _IO_backup_base
    <15a>   DW_AT_decl_file   : 5
    <15b>   DW_AT_decl_line   : 257
    <15d>   DW_AT_type        : <0xad>
    <161>   DW_AT_data_member_location: 80
 <2><162>: Abbrev Number: 10 (DW_TAG_member)
    <163>   DW_AT_name        : (indirect string, offset: 0xb602): _IO_save_end
    <167>   DW_AT_decl_file   : 5
    <168>   DW_AT_decl_line   : 258
    <16a>   DW_AT_type        : <0xad>
    <16e>   DW_AT_data_member_location: 88
 <2><16f>: Abbrev Number: 10 (DW_TAG_member)
    <170>   DW_AT_name        : (indirect string, offset: 0x1069f): _markers
    <174>   DW_AT_decl_file   : 5
    <175>   DW_AT_decl_line   : 260
    <177>   DW_AT_type        : <0x285>
    <17b>   DW_AT_data_member_location: 96
 <2><17c>: Abbrev Number: 10 (DW_TAG_member)
    <17d>   DW_AT_name        : (indirect string, offset: 0x5426): _chain
    <181>   DW_AT_decl_file   : 5
    <182>   DW_AT_decl_line   : 262
    <184>   DW_AT_type        : <0x28b>
    <188>   DW_AT_data_member_location: 104
 <2><189>: Abbrev Number: 10 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0x372): _fileno
    <18e>   DW_AT_decl_file   : 5
    <18f>   DW_AT_decl_line   : 264
    <191>   DW_AT_type        : <0x3f>
    <195>   DW_AT_data_member_location: 112
 <2><196>: Abbrev Number: 10 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x1394d): _flags2
    <19b>   DW_AT_decl_file   : 5
    <19c>   DW_AT_decl_line   : 268
    <19e>   DW_AT_type        : <0x3f>
    <1a2>   DW_AT_data_member_location: 116
 <2><1a3>: Abbrev Number: 10 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x133c3): _old_offset
    <1a8>   DW_AT_decl_file   : 5
    <1a9>   DW_AT_decl_line   : 270
    <1ab>   DW_AT_type        : <0x95>
    <1af>   DW_AT_data_member_location: 120
 <2><1b0>: Abbrev Number: 10 (DW_TAG_member)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x121bc): _cur_column
    <1b5>   DW_AT_decl_file   : 5
    <1b6>   DW_AT_decl_line   : 274
    <1b8>   DW_AT_type        : <0x62>
    <1bc>   DW_AT_data_member_location: 128
 <2><1bd>: Abbrev Number: 10 (DW_TAG_member)
    <1be>   DW_AT_name        : (indirect string, offset: 0x15589): _vtable_offset
    <1c2>   DW_AT_decl_file   : 5
    <1c3>   DW_AT_decl_line   : 275
    <1c5>   DW_AT_type        : <0x87>
    <1c9>   DW_AT_data_member_location: 130
 <2><1ca>: Abbrev Number: 10 (DW_TAG_member)
    <1cb>   DW_AT_name        : (indirect string, offset: 0xed5): _shortbuf
    <1cf>   DW_AT_decl_file   : 5
    <1d0>   DW_AT_decl_line   : 276
    <1d2>   DW_AT_type        : <0x291>
    <1d6>   DW_AT_data_member_location: 131
 <2><1d7>: Abbrev Number: 10 (DW_TAG_member)
    <1d8>   DW_AT_name        : (indirect string, offset: 0x1da4): _lock
    <1dc>   DW_AT_decl_file   : 5
    <1dd>   DW_AT_decl_line   : 280
    <1df>   DW_AT_type        : <0x2a1>
    <1e3>   DW_AT_data_member_location: 136
 <2><1e4>: Abbrev Number: 10 (DW_TAG_member)
    <1e5>   DW_AT_name        : (indirect string, offset: 0xca21): _offset
    <1e9>   DW_AT_decl_file   : 5
    <1ea>   DW_AT_decl_line   : 289
    <1ec>   DW_AT_type        : <0xa0>
    <1f0>   DW_AT_data_member_location: 144
 <2><1f1>: Abbrev Number: 10 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0x1032d): __pad1
    <1f6>   DW_AT_decl_file   : 5
    <1f7>   DW_AT_decl_line   : 297
    <1f9>   DW_AT_type        : <0xab>
    <1fd>   DW_AT_data_member_location: 152
 <2><1fe>: Abbrev Number: 10 (DW_TAG_member)
    <1ff>   DW_AT_name        : (indirect string, offset: 0x8e5a): __pad2
    <203>   DW_AT_decl_file   : 5
    <204>   DW_AT_decl_line   : 298
    <206>   DW_AT_type        : <0xab>
    <20a>   DW_AT_data_member_location: 160
 <2><20b>: Abbrev Number: 10 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0x10334): __pad3
    <210>   DW_AT_decl_file   : 5
    <211>   DW_AT_decl_line   : 299
    <213>   DW_AT_type        : <0xab>
    <217>   DW_AT_data_member_location: 168
 <2><218>: Abbrev Number: 10 (DW_TAG_member)
    <219>   DW_AT_name        : (indirect string, offset: 0x1033b): __pad4
    <21d>   DW_AT_decl_file   : 5
    <21e>   DW_AT_decl_line   : 300
    <220>   DW_AT_type        : <0xab>
    <224>   DW_AT_data_member_location: 176
 <2><225>: Abbrev Number: 10 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x10342): __pad5
    <22a>   DW_AT_decl_file   : 5
    <22b>   DW_AT_decl_line   : 302
    <22d>   DW_AT_type        : <0x2d>
    <231>   DW_AT_data_member_location: 184
 <2><232>: Abbrev Number: 10 (DW_TAG_member)
    <233>   DW_AT_name        : (indirect string, offset: 0xd00c): _mode
    <237>   DW_AT_decl_file   : 5
    <238>   DW_AT_decl_line   : 303
    <23a>   DW_AT_type        : <0x3f>
    <23e>   DW_AT_data_member_location: 192
 <2><23f>: Abbrev Number: 10 (DW_TAG_member)
    <240>   DW_AT_name        : (indirect string, offset: 0x26f): _unused2
    <244>   DW_AT_decl_file   : 5
    <245>   DW_AT_decl_line   : 305
    <247>   DW_AT_type        : <0x2a7>
    <24b>   DW_AT_data_member_location: 196
 <2><24c>: Abbrev Number: 0
 <1><24d>: Abbrev Number: 11 (DW_TAG_typedef)
    <24e>   DW_AT_name        : (indirect string, offset: 0x5ac4): _IO_lock_t
    <252>   DW_AT_decl_file   : 5
    <253>   DW_AT_decl_line   : 150
 <1><254>: Abbrev Number: 8 (DW_TAG_structure_type)
    <255>   DW_AT_name        : (indirect string, offset: 0xd9e9): _IO_marker
    <259>   DW_AT_byte_size   : 24
    <25a>   DW_AT_decl_file   : 5
    <25b>   DW_AT_decl_line   : 156
    <25c>   DW_AT_sibling     : <0x285>
 <2><260>: Abbrev Number: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0x9975): _next
    <265>   DW_AT_decl_file   : 5
    <266>   DW_AT_decl_line   : 157
    <267>   DW_AT_type        : <0x285>
    <26b>   DW_AT_data_member_location: 0
 <2><26c>: Abbrev Number: 9 (DW_TAG_member)
    <26d>   DW_AT_name        : (indirect string, offset: 0xb527): _sbuf
    <271>   DW_AT_decl_file   : 5
    <272>   DW_AT_decl_line   : 158
    <273>   DW_AT_type        : <0x28b>
    <277>   DW_AT_data_member_location: 8
 <2><278>: Abbrev Number: 9 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x106a8): _pos
    <27d>   DW_AT_decl_file   : 5
    <27e>   DW_AT_decl_line   : 162
    <27f>   DW_AT_type        : <0x3f>
    <283>   DW_AT_data_member_location: 16
 <2><284>: Abbrev Number: 0
 <1><285>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <286>   DW_AT_byte_size   : 8
    <287>   DW_AT_type        : <0x254>
 <1><28b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <28c>   DW_AT_byte_size   : 8
    <28d>   DW_AT_type        : <0xd0>
 <1><291>: Abbrev Number: 12 (DW_TAG_array_type)
    <292>   DW_AT_type        : <0x74>
    <296>   DW_AT_sibling     : <0x2a1>
 <2><29a>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <29b>   DW_AT_type        : <0x5b>
    <29f>   DW_AT_upper_bound : 0
 <2><2a0>: Abbrev Number: 0
 <1><2a1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <2a2>   DW_AT_byte_size   : 8
    <2a3>   DW_AT_type        : <0x24d>
 <1><2a7>: Abbrev Number: 12 (DW_TAG_array_type)
    <2a8>   DW_AT_type        : <0x74>
    <2ac>   DW_AT_sibling     : <0x2b7>
 <2><2b0>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <2b1>   DW_AT_type        : <0x5b>
    <2b5>   DW_AT_upper_bound : 19
 <2><2b6>: Abbrev Number: 0
 <1><2b7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2b8>   DW_AT_name        : (indirect string, offset: 0x1d35): _IO_FILE_plus
    <2bc>   DW_AT_declaration : 1
 <1><2bc>: Abbrev Number: 15 (DW_TAG_variable)
    <2bd>   DW_AT_name        : (indirect string, offset: 0xfc75): _IO_2_1_stdin_
    <2c1>   DW_AT_decl_file   : 5
    <2c2>   DW_AT_decl_line   : 315
    <2c4>   DW_AT_type        : <0x2b7>
    <2c8>   DW_AT_external    : 1
    <2c8>   DW_AT_declaration : 1
 <1><2c8>: Abbrev Number: 15 (DW_TAG_variable)
    <2c9>   DW_AT_name        : (indirect string, offset: 0xe18b): _IO_2_1_stdout_
    <2cd>   DW_AT_decl_file   : 5
    <2ce>   DW_AT_decl_line   : 316
    <2d0>   DW_AT_type        : <0x2b7>
    <2d4>   DW_AT_external    : 1
    <2d4>   DW_AT_declaration : 1
 <1><2d4>: Abbrev Number: 15 (DW_TAG_variable)
    <2d5>   DW_AT_name        : (indirect string, offset: 0xb3a4): _IO_2_1_stderr_
    <2d9>   DW_AT_decl_file   : 5
    <2da>   DW_AT_decl_line   : 317
    <2dc>   DW_AT_type        : <0x2b7>
    <2e0>   DW_AT_external    : 1
    <2e0>   DW_AT_declaration : 1
 <1><2e0>: Abbrev Number: 16 (DW_TAG_variable)
    <2e1>   DW_AT_name        : (indirect string, offset: 0xed2c): stdin
    <2e5>   DW_AT_decl_file   : 6
    <2e6>   DW_AT_decl_line   : 170
    <2e7>   DW_AT_type        : <0x28b>
    <2eb>   DW_AT_external    : 1
    <2eb>   DW_AT_declaration : 1
 <1><2eb>: Abbrev Number: 16 (DW_TAG_variable)
    <2ec>   DW_AT_name        : (indirect string, offset: 0xb8c3): stdout
    <2f0>   DW_AT_decl_file   : 6
    <2f1>   DW_AT_decl_line   : 171
    <2f2>   DW_AT_type        : <0x28b>
    <2f6>   DW_AT_external    : 1
    <2f6>   DW_AT_declaration : 1
 <1><2f6>: Abbrev Number: 16 (DW_TAG_variable)
    <2f7>   DW_AT_name        : (indirect string, offset: 0xb3b4): stderr
    <2fb>   DW_AT_decl_file   : 6
    <2fc>   DW_AT_decl_line   : 172
    <2fd>   DW_AT_type        : <0x28b>
    <301>   DW_AT_external    : 1
    <301>   DW_AT_declaration : 1
 <1><301>: Abbrev Number: 16 (DW_TAG_variable)
    <302>   DW_AT_name        : (indirect string, offset: 0x141f7): sys_nerr
    <306>   DW_AT_decl_file   : 7
    <307>   DW_AT_decl_line   : 26
    <308>   DW_AT_type        : <0x3f>
    <30c>   DW_AT_external    : 1
    <30c>   DW_AT_declaration : 1
 <1><30c>: Abbrev Number: 12 (DW_TAG_array_type)
    <30d>   DW_AT_type        : <0x6f>
    <311>   DW_AT_sibling     : <0x317>
 <2><315>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><316>: Abbrev Number: 0
 <1><317>: Abbrev Number: 6 (DW_TAG_const_type)
    <318>   DW_AT_type        : <0x30c>
 <1><31c>: Abbrev Number: 16 (DW_TAG_variable)
    <31d>   DW_AT_name        : (indirect string, offset: 0x4add): sys_errlist
    <321>   DW_AT_decl_file   : 7
    <322>   DW_AT_decl_line   : 27
    <323>   DW_AT_type        : <0x317>
    <327>   DW_AT_external    : 1
    <327>   DW_AT_declaration : 1
 <1><327>: Abbrev Number: 16 (DW_TAG_variable)
    <328>   DW_AT_name        : (indirect string, offset: 0x13010): _sys_nerr
    <32c>   DW_AT_decl_file   : 7
    <32d>   DW_AT_decl_line   : 30
    <32e>   DW_AT_type        : <0x3f>
    <332>   DW_AT_external    : 1
    <332>   DW_AT_declaration : 1
 <1><332>: Abbrev Number: 16 (DW_TAG_variable)
    <333>   DW_AT_name        : (indirect string, offset: 0x1ce): _sys_errlist
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 31
    <339>   DW_AT_type        : <0x317>
    <33d>   DW_AT_external    : 1
    <33d>   DW_AT_declaration : 1
 <1><33d>: Abbrev Number: 15 (DW_TAG_variable)
    <33e>   DW_AT_name        : (indirect string, offset: 0x1367): __environ
    <342>   DW_AT_decl_file   : 8
    <343>   DW_AT_decl_line   : 546
    <345>   DW_AT_type        : <0x349>
    <349>   DW_AT_external    : 1
    <349>   DW_AT_declaration : 1
 <1><349>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <34a>   DW_AT_byte_size   : 8
    <34b>   DW_AT_type        : <0xad>
 <1><34f>: Abbrev Number: 15 (DW_TAG_variable)
    <350>   DW_AT_name        : (indirect string, offset: 0x871d): environ
    <354>   DW_AT_decl_file   : 8
    <355>   DW_AT_decl_line   : 548
    <357>   DW_AT_type        : <0x349>
    <35b>   DW_AT_external    : 1
    <35b>   DW_AT_declaration : 1
 <1><35b>: Abbrev Number: 16 (DW_TAG_variable)
    <35c>   DW_AT_name        : (indirect string, offset: 0x44e6): optarg
    <360>   DW_AT_decl_file   : 9
    <361>   DW_AT_decl_line   : 57
    <362>   DW_AT_type        : <0xad>
    <366>   DW_AT_external    : 1
    <366>   DW_AT_declaration : 1
 <1><366>: Abbrev Number: 16 (DW_TAG_variable)
    <367>   DW_AT_name        : (indirect string, offset: 0x136f6): optind
    <36b>   DW_AT_decl_file   : 9
    <36c>   DW_AT_decl_line   : 71
    <36d>   DW_AT_type        : <0x3f>
    <371>   DW_AT_external    : 1
    <371>   DW_AT_declaration : 1
 <1><371>: Abbrev Number: 16 (DW_TAG_variable)
    <372>   DW_AT_name        : (indirect string, offset: 0xcecd): opterr
    <376>   DW_AT_decl_file   : 9
    <377>   DW_AT_decl_line   : 76
    <378>   DW_AT_type        : <0x3f>
    <37c>   DW_AT_external    : 1
    <37c>   DW_AT_declaration : 1
 <1><37c>: Abbrev Number: 16 (DW_TAG_variable)
    <37d>   DW_AT_name        : (indirect string, offset: 0xb90d): optopt
    <381>   DW_AT_decl_file   : 9
    <382>   DW_AT_decl_line   : 80
    <383>   DW_AT_type        : <0x3f>
    <387>   DW_AT_external    : 1
    <387>   DW_AT_declaration : 1
 <1><387>: Abbrev Number: 3 (DW_TAG_base_type)
    <388>   DW_AT_byte_size   : 4
    <389>   DW_AT_encoding    : 4	(float)
    <38a>   DW_AT_name        : (indirect string, offset: 0x5b3d): float
 <1><38e>: Abbrev Number: 3 (DW_TAG_base_type)
    <38f>   DW_AT_byte_size   : 8
    <390>   DW_AT_encoding    : 4	(float)
    <391>   DW_AT_name        : (indirect string, offset: 0x10aa4): double
 <1><395>: Abbrev Number: 16 (DW_TAG_variable)
    <396>   DW_AT_name        : (indirect string, offset: 0x94a3): signgam
    <39a>   DW_AT_decl_file   : 10
    <39b>   DW_AT_decl_line   : 168
    <39c>   DW_AT_type        : <0x3f>
    <3a0>   DW_AT_external    : 1
    <3a0>   DW_AT_declaration : 1
 <1><3a0>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <3a1>   DW_AT_byte_size   : 4
    <3a2>   DW_AT_type        : <0x3f>
    <3a6>   DW_AT_decl_file   : 10
    <3a7>   DW_AT_decl_line   : 348
    <3a9>   DW_AT_sibling     : <0x3cc>
 <2><3ad>: Abbrev Number: 19 (DW_TAG_enumerator)
    <3ae>   DW_AT_name        : (indirect string, offset: 0x13955): _IEEE_
    <3b2>   DW_AT_const_value : -1
 <2><3b3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <3b4>   DW_AT_name        : (indirect string, offset: 0xd5ce): _SVID_
    <3b8>   DW_AT_const_value : 0
 <2><3b9>: Abbrev Number: 20 (DW_TAG_enumerator)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x1076f): _XOPEN_
    <3be>   DW_AT_const_value : 1
 <2><3bf>: Abbrev Number: 20 (DW_TAG_enumerator)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x159f6): _POSIX_
    <3c4>   DW_AT_const_value : 2
 <2><3c5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <3c6>   DW_AT_name        : (indirect string, offset: 0xd123): _ISOC_
    <3ca>   DW_AT_const_value : 3
 <2><3cb>: Abbrev Number: 0
 <1><3cc>: Abbrev Number: 21 (DW_TAG_typedef)
    <3cd>   DW_AT_name        : (indirect string, offset: 0x167f): _LIB_VERSION_TYPE
    <3d1>   DW_AT_decl_file   : 10
    <3d2>   DW_AT_decl_line   : 354
    <3d4>   DW_AT_type        : <0x3a0>
 <1><3d8>: Abbrev Number: 15 (DW_TAG_variable)
    <3d9>   DW_AT_name        : (indirect string, offset: 0x4570): _LIB_VERSION
    <3dd>   DW_AT_decl_file   : 10
    <3de>   DW_AT_decl_line   : 359
    <3e0>   DW_AT_type        : <0x3cc>
    <3e4>   DW_AT_external    : 1
    <3e4>   DW_AT_declaration : 1
 <1><3e4>: Abbrev Number: 2 (DW_TAG_typedef)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x7b53): uint8_t
    <3e9>   DW_AT_decl_file   : 11
    <3ea>   DW_AT_decl_line   : 48
    <3eb>   DW_AT_type        : <0x80>
 <1><3ef>: Abbrev Number: 2 (DW_TAG_typedef)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x1537): uint16_t
    <3f4>   DW_AT_decl_file   : 11
    <3f5>   DW_AT_decl_line   : 49
    <3f6>   DW_AT_type        : <0x62>
 <1><3fa>: Abbrev Number: 2 (DW_TAG_typedef)
    <3fb>   DW_AT_name        : (indirect string, offset: 0xe0b7): uint32_t
    <3ff>   DW_AT_decl_file   : 11
    <400>   DW_AT_decl_line   : 51
    <401>   DW_AT_type        : <0x46>
 <1><405>: Abbrev Number: 2 (DW_TAG_typedef)
    <406>   DW_AT_name        : (indirect string, offset: 0x6814): uint64_t
    <40a>   DW_AT_decl_file   : 11
    <40b>   DW_AT_decl_line   : 55
    <40c>   DW_AT_type        : <0x38>
 <1><410>: Abbrev Number: 2 (DW_TAG_typedef)
    <411>   DW_AT_name        : (indirect string, offset: 0x12657): NbEnumerationLiteral_t
    <415>   DW_AT_decl_file   : 12
    <416>   DW_AT_decl_line   : 29
    <417>   DW_AT_type        : <0x3e4>
 <1><41b>: Abbrev Number: 2 (DW_TAG_typedef)
    <41c>   DW_AT_name        : (indirect string, offset: 0x5664): NbSignalEvents_t
    <420>   DW_AT_decl_file   : 12
    <421>   DW_AT_decl_line   : 30
    <422>   DW_AT_type        : <0x3e4>
 <1><426>: Abbrev Number: 2 (DW_TAG_typedef)
    <427>   DW_AT_name        : (indirect string, offset: 0xeac): NbPorts_t
    <42b>   DW_AT_decl_file   : 12
    <42c>   DW_AT_decl_line   : 34
    <42d>   DW_AT_type        : <0x3e4>
 <1><431>: Abbrev Number: 2 (DW_TAG_typedef)
    <432>   DW_AT_name        : (indirect string, offset: 0x14393): NbActiveObjects_t
    <436>   DW_AT_decl_file   : 12
    <437>   DW_AT_decl_line   : 45
    <438>   DW_AT_type        : <0xb3>
 <1><43c>: Abbrev Number: 2 (DW_TAG_typedef)
    <43d>   DW_AT_name        : (indirect string, offset: 0x872): NbPassiveObjects_t
    <441>   DW_AT_decl_file   : 12
    <442>   DW_AT_decl_line   : 46
    <443>   DW_AT_type        : <0x3e4>
 <1><447>: Abbrev Number: 2 (DW_TAG_typedef)
    <448>   DW_AT_name        : (indirect string, offset: 0x750d): NbFireables_t
    <44c>   DW_AT_decl_file   : 12
    <44d>   DW_AT_decl_line   : 50
    <44e>   DW_AT_type        : <0xb3>
 <1><452>: Abbrev Number: 2 (DW_TAG_typedef)
    <453>   DW_AT_name        : (indirect string, offset: 0x407c): NbOutgoings_t
    <457>   DW_AT_decl_file   : 12
    <458>   DW_AT_decl_line   : 51
    <459>   DW_AT_type        : <0xb3>
 <1><45d>: Abbrev Number: 2 (DW_TAG_typedef)
    <45e>   DW_AT_name        : (indirect string, offset: 0x130cd): FireablesLength_t
    <462>   DW_AT_decl_file   : 12
    <463>   DW_AT_decl_line   : 52
    <464>   DW_AT_type        : <0xb3>
 <1><468>: Abbrev Number: 2 (DW_TAG_typedef)
    <469>   DW_AT_name        : (indirect string, offset: 0x11ada): StoreSize_t
    <46d>   DW_AT_decl_file   : 12
    <46e>   DW_AT_decl_line   : 53
    <46f>   DW_AT_type        : <0x3ef>
 <1><473>: Abbrev Number: 2 (DW_TAG_typedef)
    <474>   DW_AT_name        : (indirect string, offset: 0xfd53): NbPropertiesRO_t
    <478>   DW_AT_decl_file   : 12
    <479>   DW_AT_decl_line   : 55
    <47a>   DW_AT_type        : <0x3e4>
 <1><47e>: Abbrev Number: 2 (DW_TAG_typedef)
    <47f>   DW_AT_name        : (indirect string, offset: 0xfe33): NbFifoElements_t
    <483>   DW_AT_decl_file   : 12
    <484>   DW_AT_decl_line   : 57
    <485>   DW_AT_type        : <0x3e4>
 <1><489>: Abbrev Number: 2 (DW_TAG_typedef)
    <48a>   DW_AT_name        : (indirect string, offset: 0x12f29): ObjectMultiplicity_t
    <48e>   DW_AT_decl_file   : 12
    <48f>   DW_AT_decl_line   : 58
    <490>   DW_AT_type        : <0x3e4>
 <1><494>: Abbrev Number: 2 (DW_TAG_typedef)
    <495>   DW_AT_name        : (indirect string, offset: 0xefd8): NbEvents_t
    <499>   DW_AT_decl_file   : 12
    <49a>   DW_AT_decl_line   : 63
    <49b>   DW_AT_type        : <0x3e4>
 <1><49f>: Abbrev Number: 2 (DW_TAG_typedef)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x6b98): EventSetSize_t
    <4a4>   DW_AT_decl_file   : 12
    <4a5>   DW_AT_decl_line   : 64
    <4a6>   DW_AT_type        : <0x3e4>
 <1><4aa>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <4ab>   DW_AT_byte_size   : 4
    <4ac>   DW_AT_type        : <0x46>
    <4b0>   DW_AT_decl_file   : 13
    <4b1>   DW_AT_decl_line   : 17
    <4b2>   DW_AT_sibling     : <0x4cf>
 <2><4b6>: Abbrev Number: 20 (DW_TAG_enumerator)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x17dd): C_UML_PrimitiveType
    <4bb>   DW_AT_const_value : 0
 <2><4bc>: Abbrev Number: 20 (DW_TAG_enumerator)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x5493): C_UML_Class
    <4c1>   DW_AT_const_value : 1
 <2><4c2>: Abbrev Number: 20 (DW_TAG_enumerator)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xe0c0): C_UML_Association
    <4c7>   DW_AT_const_value : 2
 <2><4c8>: Abbrev Number: 20 (DW_TAG_enumerator)
    <4c9>   DW_AT_name        : (indirect string, offset: 0xc881): C_UML_Interface
    <4cd>   DW_AT_const_value : 3
 <2><4ce>: Abbrev Number: 0
 <1><4cf>: Abbrev Number: 2 (DW_TAG_typedef)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xa220): C_UML_ClassifierKind
    <4d4>   DW_AT_decl_file   : 13
    <4d5>   DW_AT_decl_line   : 22
    <4d6>   DW_AT_type        : <0x4aa>
 <1><4da>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <4db>   DW_AT_byte_size   : 4
    <4dc>   DW_AT_type        : <0x46>
    <4e0>   DW_AT_decl_file   : 13
    <4e1>   DW_AT_decl_line   : 29
    <4e2>   DW_AT_sibling     : <0x4f3>
 <2><4e6>: Abbrev Number: 20 (DW_TAG_enumerator)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x26b6): C_UML_State
    <4eb>   DW_AT_const_value : 0
 <2><4ec>: Abbrev Number: 20 (DW_TAG_enumerator)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x142a5): C_UML_Pseudostate
    <4f1>   DW_AT_const_value : 1
 <2><4f2>: Abbrev Number: 0
 <1><4f3>: Abbrev Number: 2 (DW_TAG_typedef)
    <4f4>   DW_AT_name        : (indirect string, offset: 0xff18): C_UML_VertexKind
    <4f8>   DW_AT_decl_file   : 13
    <4f9>   DW_AT_decl_line   : 32
    <4fa>   DW_AT_type        : <0x4da>
 <1><4fe>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <4ff>   DW_AT_byte_size   : 4
    <500>   DW_AT_type        : <0x46>
    <504>   DW_AT_decl_file   : 13
    <505>   DW_AT_decl_line   : 40
    <506>   DW_AT_sibling     : <0x51d>
 <2><50a>: Abbrev Number: 20 (DW_TAG_enumerator)
    <50b>   DW_AT_name        : (indirect string, offset: 0x155e1): C_UML_Behavior
    <50f>   DW_AT_const_value : 0
 <2><510>: Abbrev Number: 20 (DW_TAG_enumerator)
    <511>   DW_AT_name        : (indirect string, offset: 0x82b9): C_UML_StateMachine
    <515>   DW_AT_const_value : 1
 <2><516>: Abbrev Number: 20 (DW_TAG_enumerator)
    <517>   DW_AT_name        : (indirect string, offset: 0x12c8f): C_UML_OpaqueBehavior
    <51b>   DW_AT_const_value : 2
 <2><51c>: Abbrev Number: 0
 <1><51d>: Abbrev Number: 2 (DW_TAG_typedef)
    <51e>   DW_AT_name        : (indirect string, offset: 0x60dc): C_UML_BehaviorKind
    <522>   DW_AT_decl_file   : 13
    <523>   DW_AT_decl_line   : 44
    <524>   DW_AT_type        : <0x4fe>
 <1><528>: Abbrev Number: 2 (DW_TAG_typedef)
    <529>   DW_AT_name        : (indirect string, offset: 0x14b61): DescriptorType
    <52d>   DW_AT_decl_file   : 14
    <52e>   DW_AT_decl_line   : 22
    <52f>   DW_AT_type        : <0x533>
 <1><533>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <534>   DW_AT_name        : (indirect string, offset: 0x14b61): DescriptorType
    <538>   DW_AT_byte_size   : 4
    <539>   DW_AT_type        : <0x46>
    <53d>   DW_AT_decl_file   : 14
    <53e>   DW_AT_decl_line   : 22
    <53f>   DW_AT_sibling     : <0x61c>
 <2><543>: Abbrev Number: 20 (DW_TAG_enumerator)
    <544>   DW_AT_name        : (indirect string, offset: 0x15a91): DESC_TYPE_UML_Property
    <548>   DW_AT_const_value : 0
 <2><549>: Abbrev Number: 20 (DW_TAG_enumerator)
    <54a>   DW_AT_name        : (indirect string, offset: 0xb6e): DESC_TYPE_UML_Class
    <54e>   DW_AT_const_value : 1
 <2><54f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <550>   DW_AT_name        : (indirect string, offset: 0xf370): DESC_TYPE_UML_Port
    <554>   DW_AT_const_value : 2
 <2><555>: Abbrev Number: 20 (DW_TAG_enumerator)
    <556>   DW_AT_name        : (indirect string, offset: 0x9850): DESC_TYPE_UML_Constraint
    <55a>   DW_AT_const_value : 3
 <2><55b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <55c>   DW_AT_name        : (indirect string, offset: 0xb40a): DESC_TYPE_UML_ConnectorEnd
    <560>   DW_AT_const_value : 4
 <2><561>: Abbrev Number: 20 (DW_TAG_enumerator)
    <562>   DW_AT_name        : (indirect string, offset: 0x8f0): DESC_TYPE_UML_SignalEvent
    <566>   DW_AT_const_value : 5
 <2><567>: Abbrev Number: 20 (DW_TAG_enumerator)
    <568>   DW_AT_name        : (indirect string, offset: 0xe260): DESC_TYPE_UML_Connector
    <56c>   DW_AT_const_value : 6
 <2><56d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <56e>   DW_AT_name        : (indirect string, offset: 0xd2cd): DESC_TYPE_UML_InterfaceRealization
    <572>   DW_AT_const_value : 7
 <2><573>: Abbrev Number: 20 (DW_TAG_enumerator)
    <574>   DW_AT_name        : (indirect string, offset: 0xe1ea): DESC_TYPE_UML_OpaqueExpression
    <578>   DW_AT_const_value : 8
 <2><579>: Abbrev Number: 20 (DW_TAG_enumerator)
    <57a>   DW_AT_name        : (indirect string, offset: 0xe4a9): DESC_TYPE_UML_Interface
    <57e>   DW_AT_const_value : 9
 <2><57f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <580>   DW_AT_name        : (indirect string, offset: 0x1ae3): DESC_TYPE_UML_Reception
    <584>   DW_AT_const_value : 10
 <2><585>: Abbrev Number: 20 (DW_TAG_enumerator)
    <586>   DW_AT_name        : (indirect string, offset: 0x120c9): DESC_TYPE_UML_Pseudostate
    <58a>   DW_AT_const_value : 11
 <2><58b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <58c>   DW_AT_name        : (indirect string, offset: 0x6e61): DESC_TYPE_UML_Vertex
    <590>   DW_AT_const_value : 12
 <2><591>: Abbrev Number: 20 (DW_TAG_enumerator)
    <592>   DW_AT_name        : (indirect string, offset: 0xc2ac): DESC_TYPE_UML_Association
    <596>   DW_AT_const_value : 13
 <2><597>: Abbrev Number: 20 (DW_TAG_enumerator)
    <598>   DW_AT_name        : (indirect string, offset: 0x3dd0): DESC_TYPE_UML_ValueSpecification
    <59c>   DW_AT_const_value : 14
 <2><59d>: Abbrev Number: 20 (DW_TAG_enumerator)
    <59e>   DW_AT_name        : (indirect string, offset: 0x4aee): DESC_TYPE_UML_Transition
    <5a2>   DW_AT_const_value : 15
 <2><5a3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5a4>   DW_AT_name        : (indirect string, offset: 0xfd30): DESC_TYPE_UML_StructuredClassifier
    <5a8>   DW_AT_const_value : 16
 <2><5a9>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5aa>   DW_AT_name        : (indirect string, offset: 0xb261): DESC_TYPE_UML_TypedElement
    <5ae>   DW_AT_const_value : 17
 <2><5af>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5b0>   DW_AT_name        : (indirect string, offset: 0x10d6f): DESC_TYPE_UML_PrimitiveType
    <5b4>   DW_AT_const_value : 18
 <2><5b5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x10aab): DESC_TYPE_UML_StateMachine
    <5ba>   DW_AT_const_value : 19
 <2><5bb>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5bc>   DW_AT_name        : (indirect string, offset: 0xe318): DESC_TYPE_UML_BehavioralFeature
    <5c0>   DW_AT_const_value : 20
 <2><5c1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5c2>   DW_AT_name        : (indirect string, offset: 0xdce5): DESC_TYPE_UML_MultiplicityElement
    <5c6>   DW_AT_const_value : 21
 <2><5c7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5c8>   DW_AT_name        : (indirect string, offset: 0x842e): DESC_TYPE_UML_Behavior
    <5cc>   DW_AT_const_value : 22
 <2><5cd>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x42a9): DESC_TYPE_UML_OpaqueBehavior
    <5d2>   DW_AT_const_value : 23
 <2><5d3>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x7973): DESC_TYPE_UML_State
    <5d8>   DW_AT_const_value : 24
 <2><5d9>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5da>   DW_AT_name        : (indirect string, offset: 0x1293a): DESC_TYPE_UML_Trigger
    <5de>   DW_AT_const_value : 25
 <2><5df>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x1b3b): DESC_TYPE_UML_NamedElement
    <5e4>   DW_AT_const_value : 26
 <2><5e5>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5e6>   DW_AT_name        : (indirect string, offset: 0xe278): DESC_TYPE_UML_Signal
    <5ea>   DW_AT_const_value : 27
 <2><5eb>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x14200): DESC_TYPE_UML_EncapsulatedClassifier
    <5f0>   DW_AT_const_value : 28
 <2><5f1>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5f2>   DW_AT_name        : (indirect string, offset: 0xf938): DESC_TYPE_UML_Region
    <5f6>   DW_AT_const_value : 29
 <2><5f7>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x12765): DESC_TYPE_UML_Enumeration
    <5fc>   DW_AT_const_value : 30
 <2><5fd>: Abbrev Number: 20 (DW_TAG_enumerator)
    <5fe>   DW_AT_name        : (indirect string, offset: 0x751b): DESC_TYPE_UML_EnumerationLiteral
    <602>   DW_AT_const_value : 31
 <2><603>: Abbrev Number: 20 (DW_TAG_enumerator)
    <604>   DW_AT_name        : (indirect string, offset: 0xf16): DESC_TYPE_UML_Operation
    <608>   DW_AT_const_value : 32
 <2><609>: Abbrev Number: 20 (DW_TAG_enumerator)
    <60a>   DW_AT_name        : (indirect string, offset: 0x8ad8): DESC_TYPE_UML_BehavioredClassifier
    <60e>   DW_AT_const_value : 33
 <2><60f>: Abbrev Number: 20 (DW_TAG_enumerator)
    <610>   DW_AT_name        : (indirect string, offset: 0xda79): DESC_TYPE_UML_ConnectableElement
    <614>   DW_AT_const_value : 34
 <2><615>: Abbrev Number: 20 (DW_TAG_enumerator)
    <616>   DW_AT_name        : (indirect string, offset: 0x6edd): NB_DESC_TYPE
    <61a>   DW_AT_const_value : 35
 <2><61b>: Abbrev Number: 0
 <1><61c>: Abbrev Number: 12 (DW_TAG_array_type)
    <61d>   DW_AT_type        : <0x62c>
    <621>   DW_AT_sibling     : <0x62c>
 <2><625>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <626>   DW_AT_type        : <0x5b>
    <62a>   DW_AT_upper_bound : 2
 <2><62b>: Abbrev Number: 0
 <1><62c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <62d>   DW_AT_byte_size   : 8
    <62e>   DW_AT_type        : <0x3e4>
 <1><632>: Abbrev Number: 16 (DW_TAG_variable)
    <633>   DW_AT_name        : (indirect string, offset: 0x70d8): offsets_table
    <637>   DW_AT_decl_file   : 14
    <638>   DW_AT_decl_line   : 136
    <639>   DW_AT_type        : <0x61c>
    <63d>   DW_AT_external    : 1
    <63d>   DW_AT_declaration : 1
 <1><63d>: Abbrev Number: 2 (DW_TAG_typedef)
    <63e>   DW_AT_name        : (indirect string, offset: 0x12c15): C_UML_Model
    <642>   DW_AT_decl_file   : 14
    <643>   DW_AT_decl_line   : 159
    <644>   DW_AT_type        : <0x648>
 <1><648>: Abbrev Number: 24 (DW_TAG_structure_type)
    <649>   DW_AT_name        : (indirect string, offset: 0x12c15): C_UML_Model
    <64d>   DW_AT_byte_size   : 40
    <64e>   DW_AT_decl_file   : 14
    <64f>   DW_AT_decl_line   : 442
    <651>   DW_AT_sibling     : <0x697>
 <2><655>: Abbrev Number: 10 (DW_TAG_member)
    <656>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <65a>   DW_AT_decl_file   : 14
    <65b>   DW_AT_decl_line   : 443
    <65d>   DW_AT_type        : <0xad>
    <661>   DW_AT_data_member_location: 0
 <2><662>: Abbrev Number: 10 (DW_TAG_member)
    <663>   DW_AT_name        : (indirect string, offset: 0x15351): uml_signal
    <667>   DW_AT_decl_file   : 14
    <668>   DW_AT_decl_line   : 444
    <66a>   DW_AT_type        : <0x10ab>
    <66e>   DW_AT_data_member_location: 8
 <2><66f>: Abbrev Number: 10 (DW_TAG_member)
    <670>   DW_AT_name        : (indirect string, offset: 0xafb7): uml_signal_event
    <674>   DW_AT_decl_file   : 14
    <675>   DW_AT_decl_line   : 445
    <677>   DW_AT_type        : <0x10b7>
    <67b>   DW_AT_data_member_location: 16
 <2><67c>: Abbrev Number: 10 (DW_TAG_member)
    <67d>   DW_AT_name        : (indirect string, offset: 0x10462): uml_class
    <681>   DW_AT_decl_file   : 14
    <682>   DW_AT_decl_line   : 446
    <684>   DW_AT_type        : <0x10c3>
    <688>   DW_AT_data_member_location: 24
 <2><689>: Abbrev Number: 10 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x1df9): uml_association
    <68e>   DW_AT_decl_file   : 14
    <68f>   DW_AT_decl_line   : 447
    <691>   DW_AT_type        : <0x10cf>
    <695>   DW_AT_data_member_location: 32
 <2><696>: Abbrev Number: 0
 <1><697>: Abbrev Number: 2 (DW_TAG_typedef)
    <698>   DW_AT_name        : (indirect string, offset: 0xcef9): UML_VisibilityKind
    <69c>   DW_AT_decl_file   : 14
    <69d>   DW_AT_decl_line   : 160
    <69e>   DW_AT_type        : <0x6a2>
 <1><6a2>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <6a3>   DW_AT_name        : (indirect string, offset: 0xcef9): UML_VisibilityKind
    <6a7>   DW_AT_byte_size   : 4
    <6a8>   DW_AT_type        : <0x46>
    <6ac>   DW_AT_decl_file   : 14
    <6ad>   DW_AT_decl_line   : 160
    <6ae>   DW_AT_sibling     : <0x6cb>
 <2><6b2>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6b3>   DW_AT_name        : (indirect string, offset: 0x12ae3): UML_PUBLIC
    <6b7>   DW_AT_const_value : 0
 <2><6b8>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6b9>   DW_AT_name        : (indirect string, offset: 0xe044): UML_PRIVATE
    <6bd>   DW_AT_const_value : 1
 <2><6be>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6bf>   DW_AT_name        : (indirect string, offset: 0x2279): UML_PROTECTED
    <6c3>   DW_AT_const_value : 2
 <2><6c4>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6c5>   DW_AT_name        : (indirect string, offset: 0x129e6): UML_PACKAGE
    <6c9>   DW_AT_const_value : 3
 <2><6ca>: Abbrev Number: 0
 <1><6cb>: Abbrev Number: 2 (DW_TAG_typedef)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x2477): UML_PseudostateKind
    <6d0>   DW_AT_decl_file   : 14
    <6d1>   DW_AT_decl_line   : 161
    <6d2>   DW_AT_type        : <0x6d6>
 <1><6d6>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <6d7>   DW_AT_name        : (indirect string, offset: 0x2477): UML_PseudostateKind
    <6db>   DW_AT_byte_size   : 4
    <6dc>   DW_AT_type        : <0x46>
    <6e0>   DW_AT_decl_file   : 14
    <6e1>   DW_AT_decl_line   : 161
    <6e2>   DW_AT_sibling     : <0x723>
 <2><6e6>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x11f2e): UML_INITIAL
    <6eb>   DW_AT_const_value : 0
 <2><6ec>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6ed>   DW_AT_name        : (indirect string, offset: 0xc541): UML_DEEPHISTORY
    <6f1>   DW_AT_const_value : 1
 <2><6f2>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6f3>   DW_AT_name        : (indirect string, offset: 0x710b): UML_SHALLOWHISTORY
    <6f7>   DW_AT_const_value : 2
 <2><6f8>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x14f38): UML_JOIN
    <6fd>   DW_AT_const_value : 3
 <2><6fe>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6ff>   DW_AT_name        : (indirect string, offset: 0x4224): UML_FORK
    <703>   DW_AT_const_value : 4
 <2><704>: Abbrev Number: 20 (DW_TAG_enumerator)
    <705>   DW_AT_name        : (indirect string, offset: 0x11085): UML_JUNCTION
    <709>   DW_AT_const_value : 5
 <2><70a>: Abbrev Number: 20 (DW_TAG_enumerator)
    <70b>   DW_AT_name        : (indirect string, offset: 0x27f3): UML_CHOICE
    <70f>   DW_AT_const_value : 6
 <2><710>: Abbrev Number: 20 (DW_TAG_enumerator)
    <711>   DW_AT_name        : (indirect string, offset: 0x3f): UML_ENTRYPOINT
    <715>   DW_AT_const_value : 7
 <2><716>: Abbrev Number: 20 (DW_TAG_enumerator)
    <717>   DW_AT_name        : (indirect string, offset: 0x143a5): UML_EXITPOINT
    <71b>   DW_AT_const_value : 8
 <2><71c>: Abbrev Number: 20 (DW_TAG_enumerator)
    <71d>   DW_AT_name        : (indirect string, offset: 0x10e11): UML_TERMINATE
    <721>   DW_AT_const_value : 9
 <2><722>: Abbrev Number: 0
 <1><723>: Abbrev Number: 2 (DW_TAG_typedef)
    <724>   DW_AT_name        : (indirect string, offset: 0x143c1): UML_AggregationKind
    <728>   DW_AT_decl_file   : 14
    <729>   DW_AT_decl_line   : 162
    <72a>   DW_AT_type        : <0x72e>
 <1><72e>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <72f>   DW_AT_name        : (indirect string, offset: 0x143c1): UML_AggregationKind
    <733>   DW_AT_byte_size   : 4
    <734>   DW_AT_type        : <0x46>
    <738>   DW_AT_decl_file   : 14
    <739>   DW_AT_decl_line   : 162
    <73a>   DW_AT_sibling     : <0x751>
 <2><73e>: Abbrev Number: 20 (DW_TAG_enumerator)
    <73f>   DW_AT_name        : (indirect string, offset: 0x152c6): UML_NONE
    <743>   DW_AT_const_value : 0
 <2><744>: Abbrev Number: 20 (DW_TAG_enumerator)
    <745>   DW_AT_name        : (indirect string, offset: 0x5117): UML_SHARED
    <749>   DW_AT_const_value : 1
 <2><74a>: Abbrev Number: 20 (DW_TAG_enumerator)
    <74b>   DW_AT_name        : (indirect string, offset: 0x11100): UML_COMPOSITE
    <74f>   DW_AT_const_value : 2
 <2><750>: Abbrev Number: 0
 <1><751>: Abbrev Number: 2 (DW_TAG_typedef)
    <752>   DW_AT_name        : (indirect string, offset: 0xd57): UML_Constraint
    <756>   DW_AT_decl_file   : 14
    <757>   DW_AT_decl_line   : 163
    <758>   DW_AT_type        : <0x75c>
 <1><75c>: Abbrev Number: 24 (DW_TAG_structure_type)
    <75d>   DW_AT_name        : (indirect string, offset: 0xd57): UML_Constraint
    <761>   DW_AT_byte_size   : 24
    <762>   DW_AT_decl_file   : 14
    <763>   DW_AT_decl_line   : 485
    <765>   DW_AT_sibling     : <0x79e>
 <2><769>: Abbrev Number: 10 (DW_TAG_member)
    <76a>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <76e>   DW_AT_decl_file   : 14
    <76f>   DW_AT_decl_line   : 486
    <771>   DW_AT_type        : <0x528>
    <775>   DW_AT_data_member_location: 0
 <2><776>: Abbrev Number: 10 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <77b>   DW_AT_decl_file   : 14
    <77c>   DW_AT_decl_line   : 487
    <77e>   DW_AT_type        : <0x697>
    <782>   DW_AT_data_member_location: 4
 <2><783>: Abbrev Number: 10 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <788>   DW_AT_decl_file   : 14
    <789>   DW_AT_decl_line   : 487
    <78b>   DW_AT_type        : <0xad>
    <78f>   DW_AT_data_member_location: 8
 <2><790>: Abbrev Number: 10 (DW_TAG_member)
    <791>   DW_AT_name        : (indirect string, offset: 0x772f): specification
    <795>   DW_AT_decl_file   : 14
    <796>   DW_AT_decl_line   : 488
    <798>   DW_AT_type        : <0x10db>
    <79c>   DW_AT_data_member_location: 16
 <2><79d>: Abbrev Number: 0
 <1><79e>: Abbrev Number: 2 (DW_TAG_typedef)
    <79f>   DW_AT_name        : (indirect string, offset: 0xc4a6): UML_ConnectorEnd
    <7a3>   DW_AT_decl_file   : 14
    <7a4>   DW_AT_decl_line   : 164
    <7a5>   DW_AT_type        : <0x7a9>
 <1><7a9>: Abbrev Number: 24 (DW_TAG_structure_type)
    <7aa>   DW_AT_name        : (indirect string, offset: 0xc4a6): UML_ConnectorEnd
    <7ae>   DW_AT_byte_size   : 24
    <7af>   DW_AT_decl_file   : 14
    <7b0>   DW_AT_decl_line   : 498
    <7b2>   DW_AT_sibling     : <0x7eb>
 <2><7b6>: Abbrev Number: 10 (DW_TAG_member)
    <7b7>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <7bb>   DW_AT_decl_file   : 14
    <7bc>   DW_AT_decl_line   : 499
    <7be>   DW_AT_type        : <0x528>
    <7c2>   DW_AT_data_member_location: 0
 <2><7c3>: Abbrev Number: 10 (DW_TAG_member)
    <7c4>   DW_AT_name        : (indirect string, offset: 0x93a2): lower
    <7c8>   DW_AT_decl_file   : 14
    <7c9>   DW_AT_decl_line   : 500
    <7cb>   DW_AT_type        : <0x3f>
    <7cf>   DW_AT_data_member_location: 4
 <2><7d0>: Abbrev Number: 10 (DW_TAG_member)
    <7d1>   DW_AT_name        : (indirect string, offset: 0x4ae9): role
    <7d5>   DW_AT_decl_file   : 14
    <7d6>   DW_AT_decl_line   : 501
    <7d8>   DW_AT_type        : <0x10e1>
    <7dc>   DW_AT_data_member_location: 8
 <2><7dd>: Abbrev Number: 10 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0xd54e): partWithPort
    <7e2>   DW_AT_decl_file   : 14
    <7e3>   DW_AT_decl_line   : 501
    <7e5>   DW_AT_type        : <0x10e1>
    <7e9>   DW_AT_data_member_location: 16
 <2><7ea>: Abbrev Number: 0
 <1><7eb>: Abbrev Number: 2 (DW_TAG_typedef)
    <7ec>   DW_AT_name        : (indirect string, offset: 0xfb3d): UML_SignalEvent
    <7f0>   DW_AT_decl_file   : 14
    <7f1>   DW_AT_decl_line   : 165
    <7f2>   DW_AT_type        : <0x7f6>
 <1><7f6>: Abbrev Number: 24 (DW_TAG_structure_type)
    <7f7>   DW_AT_name        : (indirect string, offset: 0xfb3d): UML_SignalEvent
    <7fb>   DW_AT_byte_size   : 32
    <7fc>   DW_AT_decl_file   : 14
    <7fd>   DW_AT_decl_line   : 511
    <7ff>   DW_AT_sibling     : <0x845>
 <2><803>: Abbrev Number: 10 (DW_TAG_member)
    <804>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <808>   DW_AT_decl_file   : 14
    <809>   DW_AT_decl_line   : 512
    <80b>   DW_AT_type        : <0x528>
    <80f>   DW_AT_data_member_location: 0
 <2><810>: Abbrev Number: 10 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <815>   DW_AT_decl_file   : 14
    <816>   DW_AT_decl_line   : 513
    <818>   DW_AT_type        : <0x697>
    <81c>   DW_AT_data_member_location: 4
 <2><81d>: Abbrev Number: 10 (DW_TAG_member)
    <81e>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <822>   DW_AT_decl_file   : 14
    <823>   DW_AT_decl_line   : 513
    <825>   DW_AT_type        : <0xad>
    <829>   DW_AT_data_member_location: 8
 <2><82a>: Abbrev Number: 10 (DW_TAG_member)
    <82b>   DW_AT_name        : (indirect string, offset: 0x1182a): c_index
    <82f>   DW_AT_decl_file   : 14
    <830>   DW_AT_decl_line   : 514
    <832>   DW_AT_type        : <0x410>
    <836>   DW_AT_data_member_location: 16
 <2><837>: Abbrev Number: 10 (DW_TAG_member)
    <838>   DW_AT_name        : (indirect string, offset: 0x1d9d): signal
    <83c>   DW_AT_decl_file   : 14
    <83d>   DW_AT_decl_line   : 514
    <83f>   DW_AT_type        : <0x10b1>
    <843>   DW_AT_data_member_location: 24
 <2><844>: Abbrev Number: 0
 <1><845>: Abbrev Number: 2 (DW_TAG_typedef)
    <846>   DW_AT_name        : (indirect string, offset: 0x7310): UML_Connector
    <84a>   DW_AT_decl_file   : 14
    <84b>   DW_AT_decl_line   : 166
    <84c>   DW_AT_type        : <0x850>
 <1><850>: Abbrev Number: 24 (DW_TAG_structure_type)
    <851>   DW_AT_name        : (indirect string, offset: 0x7310): UML_Connector
    <855>   DW_AT_byte_size   : 32
    <856>   DW_AT_decl_file   : 14
    <857>   DW_AT_decl_line   : 524
    <859>   DW_AT_sibling     : <0x89f>
 <2><85d>: Abbrev Number: 10 (DW_TAG_member)
    <85e>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <862>   DW_AT_decl_file   : 14
    <863>   DW_AT_decl_line   : 525
    <865>   DW_AT_type        : <0x528>
    <869>   DW_AT_data_member_location: 0
 <2><86a>: Abbrev Number: 10 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <86f>   DW_AT_decl_file   : 14
    <870>   DW_AT_decl_line   : 526
    <872>   DW_AT_type        : <0x697>
    <876>   DW_AT_data_member_location: 4
 <2><877>: Abbrev Number: 10 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <87c>   DW_AT_decl_file   : 14
    <87d>   DW_AT_decl_line   : 526
    <87f>   DW_AT_type        : <0xad>
    <883>   DW_AT_data_member_location: 8
 <2><884>: Abbrev Number: 25 (DW_TAG_member)
    <885>   DW_AT_name        : end
    <889>   DW_AT_decl_file   : 14
    <88a>   DW_AT_decl_line   : 527
    <88c>   DW_AT_type        : <0x10e7>
    <890>   DW_AT_data_member_location: 16
 <2><891>: Abbrev Number: 10 (DW_TAG_member)
    <892>   DW_AT_name        : (indirect string, offset: 0x4a12): type
    <896>   DW_AT_decl_file   : 14
    <897>   DW_AT_decl_line   : 527
    <899>   DW_AT_type        : <0x10d5>
    <89d>   DW_AT_data_member_location: 24
 <2><89e>: Abbrev Number: 0
 <1><89f>: Abbrev Number: 2 (DW_TAG_typedef)
    <8a0>   DW_AT_name        : (indirect string, offset: 0x2fa3): UML_InterfaceRealization
    <8a4>   DW_AT_decl_file   : 14
    <8a5>   DW_AT_decl_line   : 167
    <8a6>   DW_AT_type        : <0x8aa>
 <1><8aa>: Abbrev Number: 24 (DW_TAG_structure_type)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x2fa3): UML_InterfaceRealization
    <8af>   DW_AT_byte_size   : 16
    <8b0>   DW_AT_decl_file   : 14
    <8b1>   DW_AT_decl_line   : 537
    <8b3>   DW_AT_sibling     : <0x8d2>
 <2><8b7>: Abbrev Number: 10 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <8bc>   DW_AT_decl_file   : 14
    <8bd>   DW_AT_decl_line   : 538
    <8bf>   DW_AT_type        : <0x528>
    <8c3>   DW_AT_data_member_location: 0
 <2><8c4>: Abbrev Number: 10 (DW_TAG_member)
    <8c5>   DW_AT_name        : (indirect string, offset: 0xdf17): contract
    <8c9>   DW_AT_decl_file   : 14
    <8ca>   DW_AT_decl_line   : 539
    <8cc>   DW_AT_type        : <0x10ed>
    <8d0>   DW_AT_data_member_location: 8
 <2><8d1>: Abbrev Number: 0
 <1><8d2>: Abbrev Number: 2 (DW_TAG_typedef)
    <8d3>   DW_AT_name        : (indirect string, offset: 0x3ff8): UML_OpaqueExpression
    <8d7>   DW_AT_decl_file   : 14
    <8d8>   DW_AT_decl_line   : 168
    <8d9>   DW_AT_type        : <0x8dd>
 <1><8dd>: Abbrev Number: 24 (DW_TAG_structure_type)
    <8de>   DW_AT_name        : (indirect string, offset: 0x3ff8): UML_OpaqueExpression
    <8e2>   DW_AT_byte_size   : 40
    <8e3>   DW_AT_decl_file   : 14
    <8e4>   DW_AT_decl_line   : 549
    <8e6>   DW_AT_sibling     : <0x939>
 <2><8ea>: Abbrev Number: 10 (DW_TAG_member)
    <8eb>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <8ef>   DW_AT_decl_file   : 14
    <8f0>   DW_AT_decl_line   : 550
    <8f2>   DW_AT_type        : <0x528>
    <8f6>   DW_AT_data_member_location: 0
 <2><8f7>: Abbrev Number: 10 (DW_TAG_member)
    <8f8>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <8fc>   DW_AT_decl_file   : 14
    <8fd>   DW_AT_decl_line   : 551
    <8ff>   DW_AT_type        : <0x697>
    <903>   DW_AT_data_member_location: 4
 <2><904>: Abbrev Number: 10 (DW_TAG_member)
    <905>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <909>   DW_AT_decl_file   : 14
    <90a>   DW_AT_decl_line   : 551
    <90c>   DW_AT_type        : <0xad>
    <910>   DW_AT_data_member_location: 8
 <2><911>: Abbrev Number: 10 (DW_TAG_member)
    <912>   DW_AT_name        : (indirect string, offset: 0x1354c): c_function
    <916>   DW_AT_decl_file   : 14
    <917>   DW_AT_decl_line   : 552
    <919>   DW_AT_type        : <0xab>
    <91d>   DW_AT_data_member_location: 16
 <2><91e>: Abbrev Number: 10 (DW_TAG_member)
    <91f>   DW_AT_name        : (indirect string, offset: 0x6ba7): language
    <923>   DW_AT_decl_file   : 14
    <924>   DW_AT_decl_line   : 552
    <926>   DW_AT_type        : <0x349>
    <92a>   DW_AT_data_member_location: 24
 <2><92b>: Abbrev Number: 10 (DW_TAG_member)
    <92c>   DW_AT_name        : (indirect string, offset: 0x14080): body
    <930>   DW_AT_decl_file   : 14
    <931>   DW_AT_decl_line   : 552
    <933>   DW_AT_type        : <0x349>
    <937>   DW_AT_data_member_location: 32
 <2><938>: Abbrev Number: 0
 <1><939>: Abbrev Number: 2 (DW_TAG_typedef)
    <93a>   DW_AT_name        : (indirect string, offset: 0x13398): UML_Interface
    <93e>   DW_AT_decl_file   : 14
    <93f>   DW_AT_decl_line   : 169
    <940>   DW_AT_type        : <0x944>
 <1><944>: Abbrev Number: 24 (DW_TAG_structure_type)
    <945>   DW_AT_name        : (indirect string, offset: 0x13398): UML_Interface
    <949>   DW_AT_byte_size   : 40
    <94a>   DW_AT_decl_file   : 14
    <94b>   DW_AT_decl_line   : 562
    <94d>   DW_AT_sibling     : <0x9a0>
 <2><951>: Abbrev Number: 10 (DW_TAG_member)
    <952>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <956>   DW_AT_decl_file   : 14
    <957>   DW_AT_decl_line   : 563
    <959>   DW_AT_type        : <0x528>
    <95d>   DW_AT_data_member_location: 0
 <2><95e>: Abbrev Number: 10 (DW_TAG_member)
    <95f>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <963>   DW_AT_decl_file   : 14
    <964>   DW_AT_decl_line   : 564
    <966>   DW_AT_type        : <0x697>
    <96a>   DW_AT_data_member_location: 4
 <2><96b>: Abbrev Number: 10 (DW_TAG_member)
    <96c>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <970>   DW_AT_decl_file   : 14
    <971>   DW_AT_decl_line   : 564
    <973>   DW_AT_type        : <0xad>
    <977>   DW_AT_data_member_location: 8
 <2><978>: Abbrev Number: 10 (DW_TAG_member)
    <979>   DW_AT_name        : (indirect string, offset: 0xe54a): c_kind
    <97d>   DW_AT_decl_file   : 14
    <97e>   DW_AT_decl_line   : 565
    <980>   DW_AT_type        : <0x4cf>
    <984>   DW_AT_data_member_location: 16
 <2><985>: Abbrev Number: 10 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0x128e3): ownedAttribute
    <98a>   DW_AT_decl_file   : 14
    <98b>   DW_AT_decl_line   : 565
    <98d>   DW_AT_type        : <0x10f3>
    <991>   DW_AT_data_member_location: 24
 <2><992>: Abbrev Number: 10 (DW_TAG_member)
    <993>   DW_AT_name        : (indirect string, offset: 0xf6e7): ownedReception
    <997>   DW_AT_decl_file   : 14
    <998>   DW_AT_decl_line   : 565
    <99a>   DW_AT_type        : <0x10f9>
    <99e>   DW_AT_data_member_location: 32
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x70e6): UML_Reception
    <9a5>   DW_AT_decl_file   : 14
    <9a6>   DW_AT_decl_line   : 170
    <9a7>   DW_AT_type        : <0x9ab>
 <1><9ab>: Abbrev Number: 24 (DW_TAG_structure_type)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x70e6): UML_Reception
    <9b0>   DW_AT_byte_size   : 24
    <9b1>   DW_AT_decl_file   : 14
    <9b2>   DW_AT_decl_line   : 575
    <9b4>   DW_AT_sibling     : <0x9ed>
 <2><9b8>: Abbrev Number: 10 (DW_TAG_member)
    <9b9>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <9bd>   DW_AT_decl_file   : 14
    <9be>   DW_AT_decl_line   : 576
    <9c0>   DW_AT_type        : <0x528>
    <9c4>   DW_AT_data_member_location: 0
 <2><9c5>: Abbrev Number: 10 (DW_TAG_member)
    <9c6>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <9ca>   DW_AT_decl_file   : 14
    <9cb>   DW_AT_decl_line   : 577
    <9cd>   DW_AT_type        : <0x697>
    <9d1>   DW_AT_data_member_location: 4
 <2><9d2>: Abbrev Number: 10 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <9d7>   DW_AT_decl_file   : 14
    <9d8>   DW_AT_decl_line   : 577
    <9da>   DW_AT_type        : <0xad>
    <9de>   DW_AT_data_member_location: 8
 <2><9df>: Abbrev Number: 10 (DW_TAG_member)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x1d9d): signal
    <9e4>   DW_AT_decl_file   : 14
    <9e5>   DW_AT_decl_line   : 578
    <9e7>   DW_AT_type        : <0x10b1>
    <9eb>   DW_AT_data_member_location: 16
 <2><9ec>: Abbrev Number: 0
 <1><9ed>: Abbrev Number: 2 (DW_TAG_typedef)
    <9ee>   DW_AT_name        : (indirect string, offset: 0xbf3a): UML_Pseudostate
    <9f2>   DW_AT_decl_file   : 14
    <9f3>   DW_AT_decl_line   : 171
    <9f4>   DW_AT_type        : <0x9f8>
 <1><9f8>: Abbrev Number: 24 (DW_TAG_structure_type)
    <9f9>   DW_AT_name        : (indirect string, offset: 0xbf3a): UML_Pseudostate
    <9fd>   DW_AT_byte_size   : 48
    <9fe>   DW_AT_decl_file   : 14
    <9ff>   DW_AT_decl_line   : 588
    <a01>   DW_AT_sibling     : <0xa61>
 <2><a05>: Abbrev Number: 10 (DW_TAG_member)
    <a06>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <a0a>   DW_AT_decl_file   : 14
    <a0b>   DW_AT_decl_line   : 589
    <a0d>   DW_AT_type        : <0x528>
    <a11>   DW_AT_data_member_location: 0
 <2><a12>: Abbrev Number: 10 (DW_TAG_member)
    <a13>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <a17>   DW_AT_decl_file   : 14
    <a18>   DW_AT_decl_line   : 590
    <a1a>   DW_AT_type        : <0x697>
    <a1e>   DW_AT_data_member_location: 4
 <2><a1f>: Abbrev Number: 10 (DW_TAG_member)
    <a20>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <a24>   DW_AT_decl_file   : 14
    <a25>   DW_AT_decl_line   : 590
    <a27>   DW_AT_type        : <0xad>
    <a2b>   DW_AT_data_member_location: 8
 <2><a2c>: Abbrev Number: 10 (DW_TAG_member)
    <a2d>   DW_AT_name        : (indirect string, offset: 0xe54a): c_kind
    <a31>   DW_AT_decl_file   : 14
    <a32>   DW_AT_decl_line   : 591
    <a34>   DW_AT_type        : <0x4f3>
    <a38>   DW_AT_data_member_location: 16
 <2><a39>: Abbrev Number: 10 (DW_TAG_member)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x8611): incoming
    <a3e>   DW_AT_decl_file   : 14
    <a3f>   DW_AT_decl_line   : 591
    <a41>   DW_AT_type        : <0x1105>
    <a45>   DW_AT_data_member_location: 24
 <2><a46>: Abbrev Number: 10 (DW_TAG_member)
    <a47>   DW_AT_name        : (indirect string, offset: 0x12240): outgoing
    <a4b>   DW_AT_decl_file   : 14
    <a4c>   DW_AT_decl_line   : 591
    <a4e>   DW_AT_type        : <0x1105>
    <a52>   DW_AT_data_member_location: 32
 <2><a53>: Abbrev Number: 10 (DW_TAG_member)
    <a54>   DW_AT_name        : (indirect string, offset: 0x122aa): kind
    <a58>   DW_AT_decl_file   : 14
    <a59>   DW_AT_decl_line   : 592
    <a5b>   DW_AT_type        : <0x6cb>
    <a5f>   DW_AT_data_member_location: 40
 <2><a60>: Abbrev Number: 0
 <1><a61>: Abbrev Number: 2 (DW_TAG_typedef)
    <a62>   DW_AT_name        : (indirect string, offset: 0x3661): UML_Vertex
    <a66>   DW_AT_decl_file   : 14
    <a67>   DW_AT_decl_line   : 172
    <a68>   DW_AT_type        : <0xa6c>
 <1><a6c>: Abbrev Number: 24 (DW_TAG_structure_type)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x3661): UML_Vertex
    <a71>   DW_AT_byte_size   : 40
    <a72>   DW_AT_decl_file   : 14
    <a73>   DW_AT_decl_line   : 602
    <a75>   DW_AT_sibling     : <0xac8>
 <2><a79>: Abbrev Number: 10 (DW_TAG_member)
    <a7a>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <a7e>   DW_AT_decl_file   : 14
    <a7f>   DW_AT_decl_line   : 603
    <a81>   DW_AT_type        : <0x528>
    <a85>   DW_AT_data_member_location: 0
 <2><a86>: Abbrev Number: 10 (DW_TAG_member)
    <a87>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <a8b>   DW_AT_decl_file   : 14
    <a8c>   DW_AT_decl_line   : 604
    <a8e>   DW_AT_type        : <0x697>
    <a92>   DW_AT_data_member_location: 4
 <2><a93>: Abbrev Number: 10 (DW_TAG_member)
    <a94>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <a98>   DW_AT_decl_file   : 14
    <a99>   DW_AT_decl_line   : 604
    <a9b>   DW_AT_type        : <0xad>
    <a9f>   DW_AT_data_member_location: 8
 <2><aa0>: Abbrev Number: 10 (DW_TAG_member)
    <aa1>   DW_AT_name        : (indirect string, offset: 0xe54a): c_kind
    <aa5>   DW_AT_decl_file   : 14
    <aa6>   DW_AT_decl_line   : 605
    <aa8>   DW_AT_type        : <0x4f3>
    <aac>   DW_AT_data_member_location: 16
 <2><aad>: Abbrev Number: 10 (DW_TAG_member)
    <aae>   DW_AT_name        : (indirect string, offset: 0x8611): incoming
    <ab2>   DW_AT_decl_file   : 14
    <ab3>   DW_AT_decl_line   : 605
    <ab5>   DW_AT_type        : <0x1105>
    <ab9>   DW_AT_data_member_location: 24
 <2><aba>: Abbrev Number: 10 (DW_TAG_member)
    <abb>   DW_AT_name        : (indirect string, offset: 0x12240): outgoing
    <abf>   DW_AT_decl_file   : 14
    <ac0>   DW_AT_decl_line   : 605
    <ac2>   DW_AT_type        : <0x1105>
    <ac6>   DW_AT_data_member_location: 32
 <2><ac7>: Abbrev Number: 0
 <1><ac8>: Abbrev Number: 2 (DW_TAG_typedef)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x5851): UML_Association
    <acd>   DW_AT_decl_file   : 14
    <ace>   DW_AT_decl_line   : 173
    <acf>   DW_AT_type        : <0xad3>
 <1><ad3>: Abbrev Number: 24 (DW_TAG_structure_type)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x5851): UML_Association
    <ad8>   DW_AT_byte_size   : 40
    <ad9>   DW_AT_decl_file   : 14
    <ada>   DW_AT_decl_line   : 615
    <adc>   DW_AT_sibling     : <0xb2f>
 <2><ae0>: Abbrev Number: 10 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <ae5>   DW_AT_decl_file   : 14
    <ae6>   DW_AT_decl_line   : 616
    <ae8>   DW_AT_type        : <0x528>
    <aec>   DW_AT_data_member_location: 0
 <2><aed>: Abbrev Number: 10 (DW_TAG_member)
    <aee>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <af2>   DW_AT_decl_file   : 14
    <af3>   DW_AT_decl_line   : 617
    <af5>   DW_AT_type        : <0x697>
    <af9>   DW_AT_data_member_location: 4
 <2><afa>: Abbrev Number: 10 (DW_TAG_member)
    <afb>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <aff>   DW_AT_decl_file   : 14
    <b00>   DW_AT_decl_line   : 617
    <b02>   DW_AT_type        : <0xad>
    <b06>   DW_AT_data_member_location: 8
 <2><b07>: Abbrev Number: 10 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0xe54a): c_kind
    <b0c>   DW_AT_decl_file   : 14
    <b0d>   DW_AT_decl_line   : 618
    <b0f>   DW_AT_type        : <0x4cf>
    <b13>   DW_AT_data_member_location: 16
 <2><b14>: Abbrev Number: 10 (DW_TAG_member)
    <b15>   DW_AT_name        : (indirect string, offset: 0x9b5d): memberEnd
    <b19>   DW_AT_decl_file   : 14
    <b1a>   DW_AT_decl_line   : 618
    <b1c>   DW_AT_type        : <0x10f3>
    <b20>   DW_AT_data_member_location: 24
 <2><b21>: Abbrev Number: 10 (DW_TAG_member)
    <b22>   DW_AT_name        : (indirect string, offset: 0xb583): ownedEnd
    <b26>   DW_AT_decl_file   : 14
    <b27>   DW_AT_decl_line   : 618
    <b29>   DW_AT_type        : <0x10f3>
    <b2d>   DW_AT_data_member_location: 32
 <2><b2e>: Abbrev Number: 0
 <1><b2f>: Abbrev Number: 2 (DW_TAG_typedef)
    <b30>   DW_AT_name        : (indirect string, offset: 0xa60b): UML_ValueSpecification
    <b34>   DW_AT_decl_file   : 14
    <b35>   DW_AT_decl_line   : 174
    <b36>   DW_AT_type        : <0xb3a>
 <1><b3a>: Abbrev Number: 24 (DW_TAG_structure_type)
    <b3b>   DW_AT_name        : (indirect string, offset: 0xa60b): UML_ValueSpecification
    <b3f>   DW_AT_byte_size   : 4
    <b40>   DW_AT_decl_file   : 14
    <b41>   DW_AT_decl_line   : 628
    <b43>   DW_AT_sibling     : <0xb55>
 <2><b47>: Abbrev Number: 10 (DW_TAG_member)
    <b48>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <b4c>   DW_AT_decl_file   : 14
    <b4d>   DW_AT_decl_line   : 629
    <b4f>   DW_AT_type        : <0x528>
    <b53>   DW_AT_data_member_location: 0
 <2><b54>: Abbrev Number: 0
 <1><b55>: Abbrev Number: 2 (DW_TAG_typedef)
    <b56>   DW_AT_name        : (indirect string, offset: 0x4202): UML_Property
    <b5a>   DW_AT_decl_file   : 14
    <b5b>   DW_AT_decl_line   : 175
    <b5c>   DW_AT_type        : <0xb60>
 <1><b60>: Abbrev Number: 24 (DW_TAG_structure_type)
    <b61>   DW_AT_name        : (indirect string, offset: 0x4202): UML_Property
    <b65>   DW_AT_byte_size   : 56
    <b66>   DW_AT_decl_file   : 14
    <b67>   DW_AT_decl_line   : 640
    <b69>   DW_AT_sibling     : <0xbd6>
 <2><b6d>: Abbrev Number: 10 (DW_TAG_member)
    <b6e>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <b72>   DW_AT_decl_file   : 14
    <b73>   DW_AT_decl_line   : 641
    <b75>   DW_AT_type        : <0x528>
    <b79>   DW_AT_data_member_location: 0
 <2><b7a>: Abbrev Number: 10 (DW_TAG_member)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <b7f>   DW_AT_decl_file   : 14
    <b80>   DW_AT_decl_line   : 642
    <b82>   DW_AT_type        : <0x697>
    <b86>   DW_AT_data_member_location: 4
 <2><b87>: Abbrev Number: 10 (DW_TAG_member)
    <b88>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <b8c>   DW_AT_decl_file   : 14
    <b8d>   DW_AT_decl_line   : 642
    <b8f>   DW_AT_type        : <0xad>
    <b93>   DW_AT_data_member_location: 8
 <2><b94>: Abbrev Number: 10 (DW_TAG_member)
    <b95>   DW_AT_name        : (indirect string, offset: 0x4a12): type
    <b99>   DW_AT_decl_file   : 14
    <b9a>   DW_AT_decl_line   : 643
    <b9c>   DW_AT_type        : <0x10c9>
    <ba0>   DW_AT_data_member_location: 16
 <2><ba1>: Abbrev Number: 10 (DW_TAG_member)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x93a2): lower
    <ba6>   DW_AT_decl_file   : 14
    <ba7>   DW_AT_decl_line   : 644
    <ba9>   DW_AT_type        : <0x3f>
    <bad>   DW_AT_data_member_location: 24
 <2><bae>: Abbrev Number: 10 (DW_TAG_member)
    <baf>   DW_AT_name        : (indirect string, offset: 0x1b15): association
    <bb3>   DW_AT_decl_file   : 14
    <bb4>   DW_AT_decl_line   : 645
    <bb6>   DW_AT_type        : <0x10d5>
    <bba>   DW_AT_data_member_location: 32
 <2><bbb>: Abbrev Number: 10 (DW_TAG_member)
    <bbc>   DW_AT_name        : (indirect string, offset: 0x123bd): aggregation
    <bc0>   DW_AT_decl_file   : 14
    <bc1>   DW_AT_decl_line   : 645
    <bc3>   DW_AT_type        : <0x723>
    <bc7>   DW_AT_data_member_location: 40
 <2><bc8>: Abbrev Number: 10 (DW_TAG_member)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x5b43): class
    <bcd>   DW_AT_decl_file   : 14
    <bce>   DW_AT_decl_line   : 645
    <bd0>   DW_AT_type        : <0x10c9>
    <bd4>   DW_AT_data_member_location: 48
 <2><bd5>: Abbrev Number: 0
 <1><bd6>: Abbrev Number: 2 (DW_TAG_typedef)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x82aa): UML_Transition
    <bdb>   DW_AT_decl_file   : 14
    <bdc>   DW_AT_decl_line   : 176
    <bdd>   DW_AT_type        : <0xbe1>
 <1><be1>: Abbrev Number: 24 (DW_TAG_structure_type)
    <be2>   DW_AT_name        : (indirect string, offset: 0x82aa): UML_Transition
    <be6>   DW_AT_byte_size   : 56
    <be7>   DW_AT_decl_file   : 14
    <be8>   DW_AT_decl_line   : 655
    <bea>   DW_AT_sibling     : <0xc57>
 <2><bee>: Abbrev Number: 10 (DW_TAG_member)
    <bef>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <bf3>   DW_AT_decl_file   : 14
    <bf4>   DW_AT_decl_line   : 656
    <bf6>   DW_AT_type        : <0x528>
    <bfa>   DW_AT_data_member_location: 0
 <2><bfb>: Abbrev Number: 10 (DW_TAG_member)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <c00>   DW_AT_decl_file   : 14
    <c01>   DW_AT_decl_line   : 657
    <c03>   DW_AT_type        : <0x697>
    <c07>   DW_AT_data_member_location: 4
 <2><c08>: Abbrev Number: 10 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <c0d>   DW_AT_decl_file   : 14
    <c0e>   DW_AT_decl_line   : 657
    <c10>   DW_AT_type        : <0xad>
    <c14>   DW_AT_data_member_location: 8
 <2><c15>: Abbrev Number: 10 (DW_TAG_member)
    <c16>   DW_AT_name        : (indirect string, offset: 0x11d58): guard
    <c1a>   DW_AT_decl_file   : 14
    <c1b>   DW_AT_decl_line   : 658
    <c1d>   DW_AT_type        : <0x1111>
    <c21>   DW_AT_data_member_location: 16
 <2><c22>: Abbrev Number: 10 (DW_TAG_member)
    <c23>   DW_AT_name        : (indirect string, offset: 0x68bc): effect
    <c27>   DW_AT_decl_file   : 14
    <c28>   DW_AT_decl_line   : 658
    <c2a>   DW_AT_type        : <0x1117>
    <c2e>   DW_AT_data_member_location: 24
 <2><c2f>: Abbrev Number: 10 (DW_TAG_member)
    <c30>   DW_AT_name        : (indirect string, offset: 0x2d2d): trigger
    <c34>   DW_AT_decl_file   : 14
    <c35>   DW_AT_decl_line   : 658
    <c37>   DW_AT_type        : <0x111d>
    <c3b>   DW_AT_data_member_location: 32
 <2><c3c>: Abbrev Number: 10 (DW_TAG_member)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x2f71): source
    <c41>   DW_AT_decl_file   : 14
    <c42>   DW_AT_decl_line   : 658
    <c44>   DW_AT_type        : <0x1123>
    <c48>   DW_AT_data_member_location: 40
 <2><c49>: Abbrev Number: 10 (DW_TAG_member)
    <c4a>   DW_AT_name        : (indirect string, offset: 0x60d5): target
    <c4e>   DW_AT_decl_file   : 14
    <c4f>   DW_AT_decl_line   : 658
    <c51>   DW_AT_type        : <0x1123>
    <c55>   DW_AT_data_member_location: 48
 <2><c56>: Abbrev Number: 0
 <1><c57>: Abbrev Number: 2 (DW_TAG_typedef)
    <c58>   DW_AT_name        : (indirect string, offset: 0x3fab): UML_PrimitiveType
    <c5c>   DW_AT_decl_file   : 14
    <c5d>   DW_AT_decl_line   : 179
    <c5e>   DW_AT_type        : <0xc62>
 <1><c62>: Abbrev Number: 24 (DW_TAG_structure_type)
    <c63>   DW_AT_name        : (indirect string, offset: 0x3fab): UML_PrimitiveType
    <c67>   DW_AT_byte_size   : 24
    <c68>   DW_AT_decl_file   : 14
    <c69>   DW_AT_decl_line   : 692
    <c6b>   DW_AT_sibling     : <0xca4>
 <2><c6f>: Abbrev Number: 10 (DW_TAG_member)
    <c70>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <c74>   DW_AT_decl_file   : 14
    <c75>   DW_AT_decl_line   : 693
    <c77>   DW_AT_type        : <0x528>
    <c7b>   DW_AT_data_member_location: 0
 <2><c7c>: Abbrev Number: 10 (DW_TAG_member)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <c81>   DW_AT_decl_file   : 14
    <c82>   DW_AT_decl_line   : 694
    <c84>   DW_AT_type        : <0x697>
    <c88>   DW_AT_data_member_location: 4
 <2><c89>: Abbrev Number: 10 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <c8e>   DW_AT_decl_file   : 14
    <c8f>   DW_AT_decl_line   : 694
    <c91>   DW_AT_type        : <0xad>
    <c95>   DW_AT_data_member_location: 8
 <2><c96>: Abbrev Number: 10 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0xe54a): c_kind
    <c9b>   DW_AT_decl_file   : 14
    <c9c>   DW_AT_decl_line   : 695
    <c9e>   DW_AT_type        : <0x4cf>
    <ca2>   DW_AT_data_member_location: 16
 <2><ca3>: Abbrev Number: 0
 <1><ca4>: Abbrev Number: 2 (DW_TAG_typedef)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x11c05): UML_StateMachine
    <ca9>   DW_AT_decl_file   : 14
    <caa>   DW_AT_decl_line   : 180
    <cab>   DW_AT_type        : <0xcaf>
 <1><caf>: Abbrev Number: 24 (DW_TAG_structure_type)
    <cb0>   DW_AT_name        : (indirect string, offset: 0x11c05): UML_StateMachine
    <cb4>   DW_AT_byte_size   : 24
    <cb5>   DW_AT_decl_file   : 14
    <cb6>   DW_AT_decl_line   : 705
    <cb8>   DW_AT_sibling     : <0xcf1>
 <2><cbc>: Abbrev Number: 10 (DW_TAG_member)
    <cbd>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <cc1>   DW_AT_decl_file   : 14
    <cc2>   DW_AT_decl_line   : 706
    <cc4>   DW_AT_type        : <0x528>
    <cc8>   DW_AT_data_member_location: 0
 <2><cc9>: Abbrev Number: 10 (DW_TAG_member)
    <cca>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <cce>   DW_AT_decl_file   : 14
    <ccf>   DW_AT_decl_line   : 707
    <cd1>   DW_AT_type        : <0x697>
    <cd5>   DW_AT_data_member_location: 4
 <2><cd6>: Abbrev Number: 10 (DW_TAG_member)
    <cd7>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <cdb>   DW_AT_decl_file   : 14
    <cdc>   DW_AT_decl_line   : 707
    <cde>   DW_AT_type        : <0xad>
    <ce2>   DW_AT_data_member_location: 8
 <2><ce3>: Abbrev Number: 10 (DW_TAG_member)
    <ce4>   DW_AT_name        : (indirect string, offset: 0xd239): region
    <ce8>   DW_AT_decl_file   : 14
    <ce9>   DW_AT_decl_line   : 708
    <ceb>   DW_AT_type        : <0x1135>
    <cef>   DW_AT_data_member_location: 16
 <2><cf0>: Abbrev Number: 0
 <1><cf1>: Abbrev Number: 2 (DW_TAG_typedef)
    <cf2>   DW_AT_name        : (indirect string, offset: 0xc8a2): UML_Behavior
    <cf6>   DW_AT_decl_file   : 14
    <cf7>   DW_AT_decl_line   : 183
    <cf8>   DW_AT_type        : <0xcfc>
 <1><cfc>: Abbrev Number: 24 (DW_TAG_structure_type)
    <cfd>   DW_AT_name        : (indirect string, offset: 0xc8a2): UML_Behavior
    <d01>   DW_AT_byte_size   : 8
    <d02>   DW_AT_decl_file   : 14
    <d03>   DW_AT_decl_line   : 742
    <d05>   DW_AT_sibling     : <0xd24>
 <2><d09>: Abbrev Number: 10 (DW_TAG_member)
    <d0a>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <d0e>   DW_AT_decl_file   : 14
    <d0f>   DW_AT_decl_line   : 743
    <d11>   DW_AT_type        : <0x528>
    <d15>   DW_AT_data_member_location: 0
 <2><d16>: Abbrev Number: 10 (DW_TAG_member)
    <d17>   DW_AT_name        : (indirect string, offset: 0xe54a): c_kind
    <d1b>   DW_AT_decl_file   : 14
    <d1c>   DW_AT_decl_line   : 744
    <d1e>   DW_AT_type        : <0x51d>
    <d22>   DW_AT_data_member_location: 4
 <2><d23>: Abbrev Number: 0
 <1><d24>: Abbrev Number: 2 (DW_TAG_typedef)
    <d25>   DW_AT_name        : (indirect string, offset: 0xdd75): UML_OpaqueBehavior
    <d29>   DW_AT_decl_file   : 14
    <d2a>   DW_AT_decl_line   : 184
    <d2b>   DW_AT_type        : <0xd2f>
 <1><d2f>: Abbrev Number: 24 (DW_TAG_structure_type)
    <d30>   DW_AT_name        : (indirect string, offset: 0xdd75): UML_OpaqueBehavior
    <d34>   DW_AT_byte_size   : 48
    <d35>   DW_AT_decl_file   : 14
    <d36>   DW_AT_decl_line   : 754
    <d38>   DW_AT_sibling     : <0xd98>
 <2><d3c>: Abbrev Number: 10 (DW_TAG_member)
    <d3d>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <d41>   DW_AT_decl_file   : 14
    <d42>   DW_AT_decl_line   : 755
    <d44>   DW_AT_type        : <0x528>
    <d48>   DW_AT_data_member_location: 0
 <2><d49>: Abbrev Number: 10 (DW_TAG_member)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <d4e>   DW_AT_decl_file   : 14
    <d4f>   DW_AT_decl_line   : 756
    <d51>   DW_AT_type        : <0x697>
    <d55>   DW_AT_data_member_location: 4
 <2><d56>: Abbrev Number: 10 (DW_TAG_member)
    <d57>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <d5b>   DW_AT_decl_file   : 14
    <d5c>   DW_AT_decl_line   : 756
    <d5e>   DW_AT_type        : <0xad>
    <d62>   DW_AT_data_member_location: 8
 <2><d63>: Abbrev Number: 10 (DW_TAG_member)
    <d64>   DW_AT_name        : (indirect string, offset: 0xe54a): c_kind
    <d68>   DW_AT_decl_file   : 14
    <d69>   DW_AT_decl_line   : 757
    <d6b>   DW_AT_type        : <0x51d>
    <d6f>   DW_AT_data_member_location: 16
 <2><d70>: Abbrev Number: 10 (DW_TAG_member)
    <d71>   DW_AT_name        : (indirect string, offset: 0x1354c): c_function
    <d75>   DW_AT_decl_file   : 14
    <d76>   DW_AT_decl_line   : 757
    <d78>   DW_AT_type        : <0xab>
    <d7c>   DW_AT_data_member_location: 24
 <2><d7d>: Abbrev Number: 10 (DW_TAG_member)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x6ba7): language
    <d82>   DW_AT_decl_file   : 14
    <d83>   DW_AT_decl_line   : 757
    <d85>   DW_AT_type        : <0x349>
    <d89>   DW_AT_data_member_location: 32
 <2><d8a>: Abbrev Number: 10 (DW_TAG_member)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x14080): body
    <d8f>   DW_AT_decl_file   : 14
    <d90>   DW_AT_decl_line   : 757
    <d92>   DW_AT_type        : <0x349>
    <d96>   DW_AT_data_member_location: 40
 <2><d97>: Abbrev Number: 0
 <1><d98>: Abbrev Number: 2 (DW_TAG_typedef)
    <d99>   DW_AT_name        : (indirect string, offset: 0x7d01): UML_State
    <d9d>   DW_AT_decl_file   : 14
    <d9e>   DW_AT_decl_line   : 185
    <d9f>   DW_AT_type        : <0xda3>
 <1><da3>: Abbrev Number: 24 (DW_TAG_structure_type)
    <da4>   DW_AT_name        : (indirect string, offset: 0x7d01): UML_State
    <da8>   DW_AT_byte_size   : 64
    <da9>   DW_AT_decl_file   : 14
    <daa>   DW_AT_decl_line   : 767
    <dac>   DW_AT_sibling     : <0xe26>
 <2><db0>: Abbrev Number: 10 (DW_TAG_member)
    <db1>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <db5>   DW_AT_decl_file   : 14
    <db6>   DW_AT_decl_line   : 768
    <db8>   DW_AT_type        : <0x528>
    <dbc>   DW_AT_data_member_location: 0
 <2><dbd>: Abbrev Number: 10 (DW_TAG_member)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <dc2>   DW_AT_decl_file   : 14
    <dc3>   DW_AT_decl_line   : 769
    <dc5>   DW_AT_type        : <0x697>
    <dc9>   DW_AT_data_member_location: 4
 <2><dca>: Abbrev Number: 10 (DW_TAG_member)
    <dcb>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <dcf>   DW_AT_decl_file   : 14
    <dd0>   DW_AT_decl_line   : 769
    <dd2>   DW_AT_type        : <0xad>
    <dd6>   DW_AT_data_member_location: 8
 <2><dd7>: Abbrev Number: 10 (DW_TAG_member)
    <dd8>   DW_AT_name        : (indirect string, offset: 0xe54a): c_kind
    <ddc>   DW_AT_decl_file   : 14
    <ddd>   DW_AT_decl_line   : 770
    <ddf>   DW_AT_type        : <0x4f3>
    <de3>   DW_AT_data_member_location: 16
 <2><de4>: Abbrev Number: 10 (DW_TAG_member)
    <de5>   DW_AT_name        : (indirect string, offset: 0x8611): incoming
    <de9>   DW_AT_decl_file   : 14
    <dea>   DW_AT_decl_line   : 770
    <dec>   DW_AT_type        : <0x1105>
    <df0>   DW_AT_data_member_location: 24
 <2><df1>: Abbrev Number: 10 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0x12240): outgoing
    <df6>   DW_AT_decl_file   : 14
    <df7>   DW_AT_decl_line   : 770
    <df9>   DW_AT_type        : <0x1105>
    <dfd>   DW_AT_data_member_location: 32
 <2><dfe>: Abbrev Number: 10 (DW_TAG_member)
    <dff>   DW_AT_name        : (indirect string, offset: 0xe8a6): entry
    <e03>   DW_AT_decl_file   : 14
    <e04>   DW_AT_decl_line   : 771
    <e06>   DW_AT_type        : <0x1117>
    <e0a>   DW_AT_data_member_location: 40
 <2><e0b>: Abbrev Number: 10 (DW_TAG_member)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x7386): exit
    <e10>   DW_AT_decl_file   : 14
    <e11>   DW_AT_decl_line   : 771
    <e13>   DW_AT_type        : <0x1117>
    <e17>   DW_AT_data_member_location: 48
 <2><e18>: Abbrev Number: 10 (DW_TAG_member)
    <e19>   DW_AT_name        : (indirect string, offset: 0xba6f): deferrableTrigger
    <e1d>   DW_AT_decl_file   : 14
    <e1e>   DW_AT_decl_line   : 771
    <e20>   DW_AT_type        : <0x111d>
    <e24>   DW_AT_data_member_location: 56
 <2><e25>: Abbrev Number: 0
 <1><e26>: Abbrev Number: 2 (DW_TAG_typedef)
    <e27>   DW_AT_name        : (indirect string, offset: 0xd07d): UML_Trigger
    <e2b>   DW_AT_decl_file   : 14
    <e2c>   DW_AT_decl_line   : 186
    <e2d>   DW_AT_type        : <0xe31>
 <1><e31>: Abbrev Number: 24 (DW_TAG_structure_type)
    <e32>   DW_AT_name        : (indirect string, offset: 0xd07d): UML_Trigger
    <e36>   DW_AT_byte_size   : 32
    <e37>   DW_AT_decl_file   : 14
    <e38>   DW_AT_decl_line   : 781
    <e3a>   DW_AT_sibling     : <0xe80>
 <2><e3e>: Abbrev Number: 10 (DW_TAG_member)
    <e3f>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <e43>   DW_AT_decl_file   : 14
    <e44>   DW_AT_decl_line   : 782
    <e46>   DW_AT_type        : <0x528>
    <e4a>   DW_AT_data_member_location: 0
 <2><e4b>: Abbrev Number: 10 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <e50>   DW_AT_decl_file   : 14
    <e51>   DW_AT_decl_line   : 783
    <e53>   DW_AT_type        : <0x697>
    <e57>   DW_AT_data_member_location: 4
 <2><e58>: Abbrev Number: 10 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <e5d>   DW_AT_decl_file   : 14
    <e5e>   DW_AT_decl_line   : 783
    <e60>   DW_AT_type        : <0xad>
    <e64>   DW_AT_data_member_location: 8
 <2><e65>: Abbrev Number: 10 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0x138e5): port
    <e6a>   DW_AT_decl_file   : 14
    <e6b>   DW_AT_decl_line   : 784
    <e6d>   DW_AT_type        : <0x1141>
    <e71>   DW_AT_data_member_location: 16
 <2><e72>: Abbrev Number: 10 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x184): event
    <e77>   DW_AT_decl_file   : 14
    <e78>   DW_AT_decl_line   : 784
    <e7a>   DW_AT_type        : <0x10bd>
    <e7e>   DW_AT_data_member_location: 24
 <2><e7f>: Abbrev Number: 0
 <1><e80>: Abbrev Number: 2 (DW_TAG_typedef)
    <e81>   DW_AT_name        : (indirect string, offset: 0x1540): UML_Signal
    <e85>   DW_AT_decl_file   : 14
    <e86>   DW_AT_decl_line   : 188
    <e87>   DW_AT_type        : <0xe8b>
 <1><e8b>: Abbrev Number: 24 (DW_TAG_structure_type)
    <e8c>   DW_AT_name        : (indirect string, offset: 0x1540): UML_Signal
    <e90>   DW_AT_byte_size   : 24
    <e91>   DW_AT_decl_file   : 14
    <e92>   DW_AT_decl_line   : 806
    <e94>   DW_AT_sibling     : <0xecd>
 <2><e98>: Abbrev Number: 10 (DW_TAG_member)
    <e99>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <e9d>   DW_AT_decl_file   : 14
    <e9e>   DW_AT_decl_line   : 807
    <ea0>   DW_AT_type        : <0x528>
    <ea4>   DW_AT_data_member_location: 0
 <2><ea5>: Abbrev Number: 10 (DW_TAG_member)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <eaa>   DW_AT_decl_file   : 14
    <eab>   DW_AT_decl_line   : 808
    <ead>   DW_AT_type        : <0x697>
    <eb1>   DW_AT_data_member_location: 4
 <2><eb2>: Abbrev Number: 10 (DW_TAG_member)
    <eb3>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <eb7>   DW_AT_decl_file   : 14
    <eb8>   DW_AT_decl_line   : 808
    <eba>   DW_AT_type        : <0xad>
    <ebe>   DW_AT_data_member_location: 8
 <2><ebf>: Abbrev Number: 10 (DW_TAG_member)
    <ec0>   DW_AT_name        : (indirect string, offset: 0x128e3): ownedAttribute
    <ec4>   DW_AT_decl_file   : 14
    <ec5>   DW_AT_decl_line   : 809
    <ec7>   DW_AT_type        : <0x10f3>
    <ecb>   DW_AT_data_member_location: 16
 <2><ecc>: Abbrev Number: 0
 <1><ecd>: Abbrev Number: 2 (DW_TAG_typedef)
    <ece>   DW_AT_name        : (indirect string, offset: 0xab2c): UML_Class
    <ed2>   DW_AT_decl_file   : 14
    <ed3>   DW_AT_decl_line   : 189
    <ed4>   DW_AT_type        : <0xed8>
 <1><ed8>: Abbrev Number: 24 (DW_TAG_structure_type)
    <ed9>   DW_AT_name        : (indirect string, offset: 0xab2c): UML_Class
    <edd>   DW_AT_byte_size   : 88
    <ede>   DW_AT_decl_file   : 14
    <edf>   DW_AT_decl_line   : 819
    <ee1>   DW_AT_sibling     : <0xf82>
 <2><ee5>: Abbrev Number: 10 (DW_TAG_member)
    <ee6>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <eea>   DW_AT_decl_file   : 14
    <eeb>   DW_AT_decl_line   : 820
    <eed>   DW_AT_type        : <0x528>
    <ef1>   DW_AT_data_member_location: 0
 <2><ef2>: Abbrev Number: 10 (DW_TAG_member)
    <ef3>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <ef7>   DW_AT_decl_file   : 14
    <ef8>   DW_AT_decl_line   : 821
    <efa>   DW_AT_type        : <0x697>
    <efe>   DW_AT_data_member_location: 4
 <2><eff>: Abbrev Number: 10 (DW_TAG_member)
    <f00>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <f04>   DW_AT_decl_file   : 14
    <f05>   DW_AT_decl_line   : 821
    <f07>   DW_AT_type        : <0xad>
    <f0b>   DW_AT_data_member_location: 8
 <2><f0c>: Abbrev Number: 10 (DW_TAG_member)
    <f0d>   DW_AT_name        : (indirect string, offset: 0xf89a): ownedConnector
    <f11>   DW_AT_decl_file   : 14
    <f12>   DW_AT_decl_line   : 822
    <f14>   DW_AT_type        : <0x1129>
    <f18>   DW_AT_data_member_location: 16
 <2><f19>: Abbrev Number: 10 (DW_TAG_member)
    <f1a>   DW_AT_name        : (indirect string, offset: 0x128e3): ownedAttribute
    <f1e>   DW_AT_decl_file   : 14
    <f1f>   DW_AT_decl_line   : 822
    <f21>   DW_AT_type        : <0x10f3>
    <f25>   DW_AT_data_member_location: 24
 <2><f26>: Abbrev Number: 10 (DW_TAG_member)
    <f27>   DW_AT_name        : (indirect string, offset: 0x1494f): classifierBehavior
    <f2b>   DW_AT_decl_file   : 14
    <f2c>   DW_AT_decl_line   : 823
    <f2e>   DW_AT_type        : <0x1117>
    <f32>   DW_AT_data_member_location: 32
 <2><f33>: Abbrev Number: 10 (DW_TAG_member)
    <f34>   DW_AT_name        : (indirect string, offset: 0x8ab8): interfaceRealization
    <f38>   DW_AT_decl_file   : 14
    <f39>   DW_AT_decl_line   : 823
    <f3b>   DW_AT_type        : <0x114d>
    <f3f>   DW_AT_data_member_location: 40
 <2><f40>: Abbrev Number: 10 (DW_TAG_member)
    <f41>   DW_AT_name        : (indirect string, offset: 0x10611): ownedPort
    <f45>   DW_AT_decl_file   : 14
    <f46>   DW_AT_decl_line   : 824
    <f48>   DW_AT_type        : <0x1141>
    <f4c>   DW_AT_data_member_location: 48
 <2><f4d>: Abbrev Number: 10 (DW_TAG_member)
    <f4e>   DW_AT_name        : (indirect string, offset: 0xe54a): c_kind
    <f52>   DW_AT_decl_file   : 14
    <f53>   DW_AT_decl_line   : 825
    <f55>   DW_AT_type        : <0x4cf>
    <f59>   DW_AT_data_member_location: 56
 <2><f5a>: Abbrev Number: 10 (DW_TAG_member)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x179): superClass
    <f5f>   DW_AT_decl_file   : 14
    <f60>   DW_AT_decl_line   : 825
    <f62>   DW_AT_type        : <0x10c3>
    <f66>   DW_AT_data_member_location: 64
 <2><f67>: Abbrev Number: 10 (DW_TAG_member)
    <f68>   DW_AT_name        : (indirect string, offset: 0x7037): isActive
    <f6c>   DW_AT_decl_file   : 14
    <f6d>   DW_AT_decl_line   : 825
    <f6f>   DW_AT_type        : <0x1159>
    <f73>   DW_AT_data_member_location: 72
 <2><f74>: Abbrev Number: 10 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0xf6e7): ownedReception
    <f79>   DW_AT_decl_file   : 14
    <f7a>   DW_AT_decl_line   : 825
    <f7c>   DW_AT_type        : <0x10f9>
    <f80>   DW_AT_data_member_location: 80
 <2><f81>: Abbrev Number: 0
 <1><f82>: Abbrev Number: 2 (DW_TAG_typedef)
    <f83>   DW_AT_name        : (indirect string, offset: 0xcb70): UML_Region
    <f87>   DW_AT_decl_file   : 14
    <f88>   DW_AT_decl_line   : 191
    <f89>   DW_AT_type        : <0xf8d>
 <1><f8d>: Abbrev Number: 24 (DW_TAG_structure_type)
    <f8e>   DW_AT_name        : (indirect string, offset: 0xcb70): UML_Region
    <f92>   DW_AT_byte_size   : 32
    <f93>   DW_AT_decl_file   : 14
    <f94>   DW_AT_decl_line   : 847
    <f96>   DW_AT_sibling     : <0xfdc>
 <2><f9a>: Abbrev Number: 10 (DW_TAG_member)
    <f9b>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <f9f>   DW_AT_decl_file   : 14
    <fa0>   DW_AT_decl_line   : 848
    <fa2>   DW_AT_type        : <0x528>
    <fa6>   DW_AT_data_member_location: 0
 <2><fa7>: Abbrev Number: 10 (DW_TAG_member)
    <fa8>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <fac>   DW_AT_decl_file   : 14
    <fad>   DW_AT_decl_line   : 849
    <faf>   DW_AT_type        : <0x697>
    <fb3>   DW_AT_data_member_location: 4
 <2><fb4>: Abbrev Number: 10 (DW_TAG_member)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <fb9>   DW_AT_decl_file   : 14
    <fba>   DW_AT_decl_line   : 849
    <fbc>   DW_AT_type        : <0xad>
    <fc0>   DW_AT_data_member_location: 8
 <2><fc1>: Abbrev Number: 10 (DW_TAG_member)
    <fc2>   DW_AT_name        : (indirect string, offset: 0x1c32): subvertex
    <fc6>   DW_AT_decl_file   : 14
    <fc7>   DW_AT_decl_line   : 850
    <fc9>   DW_AT_type        : <0x1160>
    <fcd>   DW_AT_data_member_location: 16
 <2><fce>: Abbrev Number: 10 (DW_TAG_member)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x10c8a): transition
    <fd3>   DW_AT_decl_file   : 14
    <fd4>   DW_AT_decl_line   : 850
    <fd6>   DW_AT_type        : <0x1105>
    <fda>   DW_AT_data_member_location: 24
 <2><fdb>: Abbrev Number: 0
 <1><fdc>: Abbrev Number: 2 (DW_TAG_typedef)
    <fdd>   DW_AT_name        : (indirect string, offset: 0xdf20): UML_Port
    <fe1>   DW_AT_decl_file   : 14
    <fe2>   DW_AT_decl_line   : 193
    <fe3>   DW_AT_type        : <0xfe7>
 <1><fe7>: Abbrev Number: 24 (DW_TAG_structure_type)
    <fe8>   DW_AT_name        : (indirect string, offset: 0xdf20): UML_Port
    <fec>   DW_AT_byte_size   : 88
    <fed>   DW_AT_decl_file   : 14
    <fee>   DW_AT_decl_line   : 873
    <ff0>   DW_AT_sibling     : <0x10ab>
 <2><ff4>: Abbrev Number: 10 (DW_TAG_member)
    <ff5>   DW_AT_name        : (indirect string, offset: 0xce68): c_type
    <ff9>   DW_AT_decl_file   : 14
    <ffa>   DW_AT_decl_line   : 874
    <ffc>   DW_AT_type        : <0x528>
    <1000>   DW_AT_data_member_location: 0
 <2><1001>: Abbrev Number: 10 (DW_TAG_member)
    <1002>   DW_AT_name        : (indirect string, offset: 0x3fd6): visibility
    <1006>   DW_AT_decl_file   : 14
    <1007>   DW_AT_decl_line   : 875
    <1009>   DW_AT_type        : <0x697>
    <100d>   DW_AT_data_member_location: 4
 <2><100e>: Abbrev Number: 10 (DW_TAG_member)
    <100f>   DW_AT_name        : (indirect string, offset: 0xb4de): name
    <1013>   DW_AT_decl_file   : 14
    <1014>   DW_AT_decl_line   : 875
    <1016>   DW_AT_type        : <0xad>
    <101a>   DW_AT_data_member_location: 8
 <2><101b>: Abbrev Number: 10 (DW_TAG_member)
    <101c>   DW_AT_name        : (indirect string, offset: 0x1b15): association
    <1020>   DW_AT_decl_file   : 14
    <1021>   DW_AT_decl_line   : 876
    <1023>   DW_AT_type        : <0x10d5>
    <1027>   DW_AT_data_member_location: 16
 <2><1028>: Abbrev Number: 10 (DW_TAG_member)
    <1029>   DW_AT_name        : (indirect string, offset: 0x123bd): aggregation
    <102d>   DW_AT_decl_file   : 14
    <102e>   DW_AT_decl_line   : 876
    <1030>   DW_AT_type        : <0x723>
    <1034>   DW_AT_data_member_location: 24
 <2><1035>: Abbrev Number: 10 (DW_TAG_member)
    <1036>   DW_AT_name        : (indirect string, offset: 0x5b43): class
    <103a>   DW_AT_decl_file   : 14
    <103b>   DW_AT_decl_line   : 876
    <103d>   DW_AT_type        : <0x10c9>
    <1041>   DW_AT_data_member_location: 32
 <2><1042>: Abbrev Number: 10 (DW_TAG_member)
    <1043>   DW_AT_name        : (indirect string, offset: 0x4a12): type
    <1047>   DW_AT_decl_file   : 14
    <1048>   DW_AT_decl_line   : 877
    <104a>   DW_AT_type        : <0x10c9>
    <104e>   DW_AT_data_member_location: 40
 <2><104f>: Abbrev Number: 25 (DW_TAG_member)
    <1050>   DW_AT_name        : end
    <1054>   DW_AT_decl_file   : 14
    <1055>   DW_AT_decl_line   : 878
    <1057>   DW_AT_type        : <0x10e7>
    <105b>   DW_AT_data_member_location: 48
 <2><105c>: Abbrev Number: 10 (DW_TAG_member)
    <105d>   DW_AT_name        : (indirect string, offset: 0x93a2): lower
    <1061>   DW_AT_decl_file   : 14
    <1062>   DW_AT_decl_line   : 879
    <1064>   DW_AT_type        : <0x3f>
    <1068>   DW_AT_data_member_location: 56
 <2><1069>: Abbrev Number: 10 (DW_TAG_member)
    <106a>   DW_AT_name        : (indirect string, offset: 0x1182a): c_index
    <106e>   DW_AT_decl_file   : 14
    <106f>   DW_AT_decl_line   : 880
    <1071>   DW_AT_type        : <0x410>
    <1075>   DW_AT_data_member_location: 60
 <2><1076>: Abbrev Number: 10 (DW_TAG_member)
    <1077>   DW_AT_name        : (indirect string, offset: 0xe918): isConjugated
    <107b>   DW_AT_decl_file   : 14
    <107c>   DW_AT_decl_line   : 880
    <107e>   DW_AT_type        : <0x1159>
    <1082>   DW_AT_data_member_location: 61
 <2><1083>: Abbrev Number: 10 (DW_TAG_member)
    <1084>   DW_AT_name        : (indirect string, offset: 0xcd0): provided
    <1088>   DW_AT_decl_file   : 14
    <1089>   DW_AT_decl_line   : 880
    <108b>   DW_AT_type        : <0x1166>
    <108f>   DW_AT_data_member_location: 64
 <2><1090>: Abbrev Number: 10 (DW_TAG_member)
    <1091>   DW_AT_name        : (indirect string, offset: 0xdfe9): isBehavior
    <1095>   DW_AT_decl_file   : 14
    <1096>   DW_AT_decl_line   : 880
    <1098>   DW_AT_type        : <0x1159>
    <109c>   DW_AT_data_member_location: 72
 <2><109d>: Abbrev Number: 10 (DW_TAG_member)
    <109e>   DW_AT_name        : (indirect string, offset: 0x7336): required
    <10a2>   DW_AT_decl_file   : 14
    <10a3>   DW_AT_decl_line   : 880
    <10a5>   DW_AT_type        : <0x1166>
    <10a9>   DW_AT_data_member_location: 80
 <2><10aa>: Abbrev Number: 0
 <1><10ab>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10ac>   DW_AT_byte_size   : 8
    <10ad>   DW_AT_type        : <0x10b1>
 <1><10b1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10b2>   DW_AT_byte_size   : 8
    <10b3>   DW_AT_type        : <0xe80>
 <1><10b7>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10b8>   DW_AT_byte_size   : 8
    <10b9>   DW_AT_type        : <0x10bd>
 <1><10bd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10be>   DW_AT_byte_size   : 8
    <10bf>   DW_AT_type        : <0x7eb>
 <1><10c3>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10c4>   DW_AT_byte_size   : 8
    <10c5>   DW_AT_type        : <0x10c9>
 <1><10c9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10ca>   DW_AT_byte_size   : 8
    <10cb>   DW_AT_type        : <0xecd>
 <1><10cf>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10d0>   DW_AT_byte_size   : 8
    <10d1>   DW_AT_type        : <0x10d5>
 <1><10d5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10d6>   DW_AT_byte_size   : 8
    <10d7>   DW_AT_type        : <0xac8>
 <1><10db>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10dc>   DW_AT_byte_size   : 8
    <10dd>   DW_AT_type        : <0xb2f>
 <1><10e1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10e2>   DW_AT_byte_size   : 8
    <10e3>   DW_AT_type        : <0xb55>
 <1><10e7>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10e8>   DW_AT_byte_size   : 8
    <10e9>   DW_AT_type        : <0x79e>
 <1><10ed>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10ee>   DW_AT_byte_size   : 8
    <10ef>   DW_AT_type        : <0x939>
 <1><10f3>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10f4>   DW_AT_byte_size   : 8
    <10f5>   DW_AT_type        : <0x10e1>
 <1><10f9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <10fa>   DW_AT_byte_size   : 8
    <10fb>   DW_AT_type        : <0x10ff>
 <1><10ff>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1100>   DW_AT_byte_size   : 8
    <1101>   DW_AT_type        : <0x9a0>
 <1><1105>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1106>   DW_AT_byte_size   : 8
    <1107>   DW_AT_type        : <0x110b>
 <1><110b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <110c>   DW_AT_byte_size   : 8
    <110d>   DW_AT_type        : <0xbd6>
 <1><1111>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1112>   DW_AT_byte_size   : 8
    <1113>   DW_AT_type        : <0x751>
 <1><1117>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1118>   DW_AT_byte_size   : 8
    <1119>   DW_AT_type        : <0xcf1>
 <1><111d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <111e>   DW_AT_byte_size   : 8
    <111f>   DW_AT_type        : <0xe26>
 <1><1123>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1124>   DW_AT_byte_size   : 8
    <1125>   DW_AT_type        : <0xa61>
 <1><1129>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <112a>   DW_AT_byte_size   : 8
    <112b>   DW_AT_type        : <0x112f>
 <1><112f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1130>   DW_AT_byte_size   : 8
    <1131>   DW_AT_type        : <0x845>
 <1><1135>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1136>   DW_AT_byte_size   : 8
    <1137>   DW_AT_type        : <0x113b>
 <1><113b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <113c>   DW_AT_byte_size   : 8
    <113d>   DW_AT_type        : <0xf82>
 <1><1141>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1142>   DW_AT_byte_size   : 8
    <1143>   DW_AT_type        : <0x1147>
 <1><1147>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1148>   DW_AT_byte_size   : 8
    <1149>   DW_AT_type        : <0xfdc>
 <1><114d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <114e>   DW_AT_byte_size   : 8
    <114f>   DW_AT_type        : <0x1153>
 <1><1153>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1154>   DW_AT_byte_size   : 8
    <1155>   DW_AT_type        : <0x89f>
 <1><1159>: Abbrev Number: 3 (DW_TAG_base_type)
    <115a>   DW_AT_byte_size   : 1
    <115b>   DW_AT_encoding    : 2	(boolean)
    <115c>   DW_AT_name        : (indirect string, offset: 0xb82): _Bool
 <1><1160>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1161>   DW_AT_byte_size   : 8
    <1162>   DW_AT_type        : <0x1123>
 <1><1166>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <1167>   DW_AT_byte_size   : 8
    <1168>   DW_AT_type        : <0x10ed>
 <1><116c>: Abbrev Number: 2 (DW_TAG_typedef)
    <116d>   DW_AT_name        : (indirect string, offset: 0x12ba8): Fifo
    <1171>   DW_AT_decl_file   : 15
    <1172>   DW_AT_decl_line   : 16
    <1173>   DW_AT_type        : <0x1177>
